/****************************************************************************/
/*	Description		:														*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC Chen.H											*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/04/11												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:														*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2020 NICHICON CORPORATION							*/
/****************************************************************************/

/*--------------------------------------------------------------------------*/
/*	Include Header File														*/
/*--------------------------------------------------------------------------*/
#include "task_g.h"
#include "esys_g.h"
#include "esys_cmn_g.h"

/*--------------------------------------------------------------------------*/
/*	公開変数定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	非公開変数定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	公開関数定義															*/
/*--------------------------------------------------------------------------*/
/*==========================================================================*/
/*	Description		:通知启动结果											*/
/*--------------------------------------------------------------------------*/
/*	param			:ulong modId:启动模块									*/
/*--------------------------------------------------------------------------*/
/*	param			:ModActionResult_t result:启动结果						*/
/*--------------------------------------------------------------------------*/
/*	return			:void													*/
/*--------------------------------------------------------------------------*/
/*	detail			:各模块将自身启动结果通知给系统管理模块						*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/11 : DHC Chen.H : 新規作成					*/
/*==========================================================================*/
void ESYS_NotifyStartResult(ulong modId, ModActionResult_t result)
{
	EsysActRsltNotify_t msg;
	DEBUG_TRCIN();
	msg.header.msgId = ESYS_MSGID_START_RESULT_NOTIFY;
	msg.modId = modId;
	msg.result = result;
	FRM_MsgSendAsync(ESYS_SPORT, sizeof(msg), &msg);
	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:通知终止结果											*/
/*--------------------------------------------------------------------------*/
/*	param			:ulong modId:终止模块									*/
/*--------------------------------------------------------------------------*/
/*	param			:ModActionResult_t result:终止结果						*/
/*--------------------------------------------------------------------------*/
/*	return			:void													*/
/*--------------------------------------------------------------------------*/
/*	detail			:各模块将自身终止结果通知给系统管理模块						*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/11 : DHC Chen.H : 新規作成					*/
/*==========================================================================*/
void ESYS_NotifyStopResult(ulong modId, ModActionResult_t result)
{
	EsysActRsltNotify_t msg;
	DEBUG_TRCIN();
	msg.header.msgId = ESYS_MSGID_STOP_RESULT_NOTIFY;
	msg.modId = modId;
	msg.result = result;
	FRM_MsgSendAsync(ESYS_SPORT, sizeof(msg), &msg);
	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:通知按键事件											*/
/*--------------------------------------------------------------------------*/
/*	param			:EKEY_Btn_t key:按键									*/
/*--------------------------------------------------------------------------*/
/*	param			:EKEY_BtnEvent_t event:按键事件							*/
/*--------------------------------------------------------------------------*/
/*	return			:void													*/
/*--------------------------------------------------------------------------*/
/*	detail			:Key模块将按键事件通知给系统管理模块						*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/11 : DHC Chen.H : 新規作成					*/
/*==========================================================================*/
void ESYS_NotifyKeyEvent(EKEY_Btn_t key, EKEY_BtnEvent_t event)
{
	EsysKeyNotify_t msg;
	ushort msgId = ESYS_MSGID_MAX;
	DEBUG_TRCIN();

	DLOG_Debug("Recv key = [%d],event = [%d]", key, event);
	switch (key)
	{
		case EKEY_BTN_SW1:
			if (EKEY_BTNEVENT_RELEASE == event)
			{
				msgId = ESYS_MSGID_KEY1_PRESSED;
			}
			else if (EKEY_BTNEVENT_LONG_RELEASE == event)
			{
				msgId = ESYS_MSGID_KEY1_LONG_PRESSED;
			}
			else
			{
				/* 処理無し */
			}
			break;
		case EKEY_BTN_SW2:
			if (EKEY_BTNEVENT_RELEASE == event)
			{
				msgId = ESYS_MSGID_KEY2_PRESSED;
			}
			else if (EKEY_BTNEVENT_LONG_RELEASE == event)
			{
				msgId = ESYS_MSGID_KEY2_LONG_PRESSED;
			}
			else
			{
				/* 処理無し */
			}
			break;
		case EKEY_PIN_A8:
			if (EKEY_BTNEVENT_PRESS == event)
			{
				msgId = ESYS_MSGID_SW1_ON;
			}
			else if (EKEY_BTNEVENT_RELEASE == event)
			{
				msgId = ESYS_MSGID_SW1_OFF;
			}
			else
			{
				/* 処理無し */
			}
			break;
		case EKEY_PIN_D10:
			if (EKEY_BTNEVENT_PRESS == event)
			{
				msgId = ESYS_MSGID_SW2_ON;
			}
			else if (EKEY_BTNEVENT_RELEASE == event)
			{
				msgId = ESYS_MSGID_SW2_OFF;
			}
			else
			{
				/* 処理無し */
			}
			break;
		case EKEY_PIN_A14:
			if (EKEY_BTNEVENT_PRESS == event)
			{
				msgId = ESYS_MSGID_SW3_ON;
			}
			else if (EKEY_BTNEVENT_RELEASE == event)
			{
				msgId = ESYS_MSGID_SW3_OFF;
			}
			else
			{
				/* 処理無し */
			}
			break;
		case EKEY_PIN_K17:
			if (EKEY_BTNEVENT_PRESS == event)
			{
				msgId = ESYS_MSGID_SW4_ON;
			}
			else if (EKEY_BTNEVENT_RELEASE == event)
			{
				msgId = ESYS_MSGID_SW4_OFF;
			}
			else
			{
				/* 処理無し */
			}
			break;
		default:
			break;
	}
	if (ESYS_MSGID_MAX != msgId)
	{
		msg.header.msgId = msgId;
		FRM_MsgSendAsync(ESYS_SPORT, sizeof(msg), &msg);
	}
	else
	{
		/* 処理無し */
	}
	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:INV通知停电状态										*/
/*--------------------------------------------------------------------------*/
/*	param			:PowerCutOperation_t status：停电状态					*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/05/6 : DHC Chen.H : 新規作成						*/
/*==========================================================================*/
void ESYS_InvNotifyPowerCutSt(PowerCutOperation_t status)
{
	EsysPowerCutSt_t msg;
	DEBUG_TRCIN();
	msg.header.msgId = ESYS_MSGID_POWER_CUT_ST_CHANGE;
	msg.status = status;
	FRM_MsgSendAsync(ESYS_SPORT, sizeof(msg), &msg);
	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:通知错误产生											*/
/*--------------------------------------------------------------------------*/
/*	param			:EdatErrInfo_t *errInfo：错误信息						*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/05/6 : DHC Chen.H : 新規作成						*/
/*==========================================================================*/
void ESYS_NotifyErrHappen(EdatErrInfo_t *errInfo)
{
	EsysMsgErrChg_t msg;
	DEBUG_TRCIN();
	msg.header.msgId = ESYS_MSGID_ERROR_HAPPEN;
	memcpy(&msg.errInfo, errInfo, sizeof(EdatErrInfo_t));
	FRM_MsgSendAsync(ESYS_SPORT, sizeof(msg), &msg);
	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:通知错误消去											*/
/*--------------------------------------------------------------------------*/
/*	param			:EdatErrInfo_t *errInfo：错误信息						*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/05/6 : DHC Chen.H : 新規作成						*/
/*==========================================================================*/
void ESYS_NotifyErrCancel(EdatErrInfo_t *errInfo)
{
	EsysMsgErrChg_t msg;
	DEBUG_TRCIN();
	msg.header.msgId = ESYS_MSGID_ERROR_CANCEL;
	memcpy(&msg.errInfo, errInfo, sizeof(EdatErrInfo_t));
	FRM_MsgSendAsync(ESYS_SPORT, sizeof(msg), &msg);
	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:通知系统关闭											*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/05/6 : DHC Chen.H : 新規作成						*/
/*==========================================================================*/
void ESYS_NotifyShutdown(void)
{
	DEBUG_TRCIN();
	esys_ShutDown();
	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:通知系统关闭											*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/05/6 : DHC Chen.H : 新規作成						*/
/*==========================================================================*/
void ESYS_NotifyReadEEPromErr(void)
{
	FrmMsgHead_t msg;
	DEBUG_TRCIN();
	msg.msgId = ESYS_MSGID_READ_EEP_ERR_HAPPEN;
	FRM_MsgSendAsync(ESYS_SPORT, sizeof(msg), &msg);
	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:通知系统关闭											*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/05/6 : DHC Chen.H : 新規作成						*/
/*==========================================================================*/
void ESYS_ClearReadEEPromErr(void)
{
	FrmMsgHead_t msg;
	DEBUG_TRCIN();
	msg.msgId = ESYS_MSGID_READ_EEP_ERR_CLEAR;
	FRM_MsgSendAsync(ESYS_SPORT, sizeof(msg), &msg);
	DEBUG_TRCOUT();
}
/*--------------------------------------------------------------------------*/
/*	非公開関数定義															*/
/*--------------------------------------------------------------------------*/


/*End Of File*/
