/****************************************************************************/
/*	Description		:ログ管理ミドル マルチリンクDCシステム用処理				*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC Jiang.Z											*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/05/09												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:														*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2020 NICHICON CORPORATION							*/
/****************************************************************************/
#ifndef __ELOG_DCS_G_H__
#define __ELOG_DCS_G_H__


/*--------------------------------------------------------------------------*/
/*	マクロ定義																*/
/*--------------------------------------------------------------------------*/
/* PVパワコン用シリアル番号オフセット */
#define	ELOG_DCS_SERNO_OFS	((uchar)15u)
#define	ELOG_DCS_SERNO_LEN	((uchar)20u)	/* PVパワコン用シリアル番号レングス */
#define	ELOG_DCS_PADCHR		((uchar)0X00u)	/* パディング文字 */
#define	ELOG_DCS_DATE_LEN	((uchar)15u)	/* 日時文字列長 'YYYYMMDD-hhmmss' */
#define ELOG_DCS_SUBNUM_MAX	((ushort)999u)	/* ファイル枝番号最大値 */
/* 保存ファイル名最大長 ('usb'/'ser'-'date'-nnn.txt) */
#define	ELOG_DCS_PATHMAX	((uchar)128u)	
#define	ELOG_DCS_DIVCHR		((uchar)0X20u)	/* ファイル出力区切り文字<sp> */

/* パディング文字コード検査 */
#define	ELOG_DCS_ISPADCHR(x)	(((x)==ELOG_DCS_PADCHR)?TRUE:FALSE)

/* 日付取得不可時のファイル名日時文字列 */
#define	ELOG_DCS_DATENGSTR	"XXXXXXXX-xxxxxx"
/* シリアル番号取得不可時のファイル名先頭文字列 */
#define	ELOG_DCS_SNONGSTR	"UNKNOWN_SNO"

/*--------------------------------------------------------------------------*/
/*	非公開型宣言、定義														*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	定数宣言、定義															*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/*	変数宣言、定義															*/
/*--------------------------------------------------------------------------*/
/***********************************************************
* @struct	ElogPcsLog_t
* @brief	マルチリンクDCSログ保存用データ
************************************************************/
typedef struct ElogPcsLog{
	bool_t useful;
	/*PcsLog_t log;*/
	schar date[ELOG_DCS_DATE_LEN + 1];
}ElogPcsLog_t;


/*--------------------------------------------------------------------------*/
/*	プロトタイプ宣言														*/
/*--------------------------------------------------------------------------*/
extern slong ELOG_DcsGetPcsLog(void);
extern slong ELOG_DcsSavePcsLog(void);

#endif /* __ELOG_DCS_G_H__ */
