
/****************************************************************************/
/*	Description		:ログ管理ミドル ユーティリティ							*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC Jiang.Z											*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/05/09												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:														*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2020 NICHICON CORPORATION							*/
/****************************************************************************/
#ifndef __ELOG_UTL_G_H__
#define __ELOG_UTL_G_H__


#include "typedef.h"
#include "elog_g.h"
/*--------------------------------------------------------------------------*/
/*	マクロ定義																*/
/*--------------------------------------------------------------------------*/


#define ELOG_MALLOC(size)			malloc(size)
#define ELOG_FREE(p)				{if((p)!=NULL){free(p);(p)=NULL;}}

#define ELOG_FOPEN(path,mode)		fopen(path,mode)
#define ELOG_FCLOSE(fp)				{if((fp)!=NULL){fclose(fp);(fp)=NULL;}}

#ifdef ELOG_SYSTEM_FUNC_DISABLE
#define	ELOG_CALL_SYSTEM(x)			0; DLOG_Error("%s\n",x)
#else
#define	ELOG_CALL_SYSTEM(x)			system(x)
#endif

/* 関数リターンコード */
#define	ELOG_OK						(0)		/* 正常終了 */
#define	ELOG_E_PARAM				(-1)	/* パラメータエラー */
#define	ELOG_E_SYSCAL				(-2)	/* システムコールエラー */
#define	ELOG_E_PROCS				(-3)	/* 処理エラー */
#define	ELOG_E_NOENT				(-4)	/* ファイル無しエラー */
#define	ELOG_E_NOSPC				(-5)	/* 空き容量不足エラー */
#define	ELOG_E_BUSY					(-6)	/* 実行中 */
#define	ELOG_E_READ					(-7)	/* 読み込みエラー */
#define	ELOG_E_WRITE				(-8)	/* 書込みエラー */
#define ELOG_EXIST					(1)		/*文件存在*/
#define ELOG_DEBUG_ON				(2)		/*debuglog开*/
#define ELOG_DEBUG_OFF				(3)		/*debuglog关*/


/*--------------------------------------------------------------------------*/
/*	非公開型宣言、定義														*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	定数宣言、定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	変数宣言、定義															*/
/*--------------------------------------------------------------------------*/



/*--------------------------------------------------------------------------*/
/*	プロトタイプ宣言														*/
/*--------------------------------------------------------------------------*/





#endif /* __ELOG_UTL_G_H__ */
