/****************************************************************************/
/*	Description		:オプションリモコン通信機能 外部IF処理					*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC KQ.Liang											*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/03/29												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:ERMC													*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2023 NICHICON CORPORATION							*/
/****************************************************************************/

/*--------------------------------------------------------------------------*/
/*	Include Header File														*/
/*--------------------------------------------------------------------------*/
#include <string.h>

#include "task_g.h"
#include "dlog_g.h"

#include "ermc_g.h"
#include "ermc_cmn_g.h"
#include "ermc_serv_g.h"

/*--------------------------------------------------------------------------*/
/*	公開変数定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	非公開変数定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	公開関数定義															*/
/*--------------------------------------------------------------------------*/
/*==========================================================================*/
/*	Description		:初期化処理を行う										*/
/*--------------------------------------------------------------------------*/
/*	param			:なし													*/
/*--------------------------------------------------------------------------*/
/*	return			:なし													*/
/*--------------------------------------------------------------------------*/
/*	detail			:本モジュールに使用するグローバル変数を初期化する		*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/03/24 : DHC KQ.Liang : 新規作成					*/
/*==========================================================================*/
void ERMC_Init(void)
{
	DEBUG_TRCIN();

	/* グローバル変数初期化 */
	ermc_InitGlobalVariable();

	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:メッセージ処理を行う									*/
/*--------------------------------------------------------------------------*/
/*	param			:msg 受信したメッセージ									*/
/*--------------------------------------------------------------------------*/
/*	return			:なし													*/
/*--------------------------------------------------------------------------*/
/*	detail			:本モジュールに受信したメッセージを処理する				*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/03/24 : DHC KQ.Liang : 新規作成					*/
/*==========================================================================*/
void ERMC_MsgProc(FrmMsgHead_t const* msg)
{
	ProcStatusChangeReq_t* procMsg;
	Cmd24InfoGetFinNty_t* cmd24Msg;
	FrmTimeout_t* timeoutMsg;

	DEBUG_TRCIN();

	switch (msg->attr)
	{
	/* 非同期メッセージ */
	case FRM_MSG_ASYNC:
		/* メッセージIDで各処理に分岐 */
		switch (msg->msgId)
		{
		/* INVマイコン初期化通信完了通知 */
		case ERMC_INV_INIT_COMM_FIN_NTY:
			DLOG_Debug("receive msgId = ERMC_INV_INIT_COMM_FIN_NTY.");

			ermc_RecvInvInitCommFinNty();
			break;

		/* OPリモコン通信開始要求 */
		case ERMC_RMC_COMM_START_REQ:
			DLOG_Debug("receive msgId = ERMC_RMC_COMM_START_REQ.");

			if (ERMC_PROC_STTS_IDLE == g_ermcProcStatus) {
				ermc_StartRmcComm();
			}
			else {
				/* 処理なし */
			}
			break;

		/* OPリモコン通信停止要求 */
		case ERMC_RMC_COMM_STOP_REQ:
			DLOG_Debug("receive msgId = ERMC_RMC_COMM_STOP_REQ.");

			ermc_StopRmcComm();
			break;

		/* プロセス状態変更要求 */
		case ERMC_PROC_STATUS_CHANGE_REQ:
			DLOG_Debug("receive msgId = ERMC_PROC_STATUS_CHANGE_REQ.");

			procMsg = (ProcStatusChangeReq_t*)msg;
			ermc_RecvProcStatusChangeReq(procMsg);
			break;

		/* (CMD24)情報取得完了通知 */
		case ERMC_CMD24_INFO_GET_FIN_NTY:
			DLOG_Debug("receive msgId = ERMC_CMD24_INFO_GET_FIN_NTY.");
			
			if (ERMC_PROC_STTS_WAITING == g_ermcProcStatus) {
				cmd24Msg = (Cmd24InfoGetFinNty_t*)msg;
				ermc_RecvCmd24ResMsgDataInfo(cmd24Msg);
			}
			else {
				/* 処理なし */
			}
			break;

		/* 非対応メッセージID */
		default:
			DLOG_Error("unsupported msgId:%d.", msg->msgId);
			break;
		}
		break;

	/* イベントメッセージ */
	case FRM_MSG_EVENT:
		/* メッセージIDで各処理に分岐 */
		switch (msg->msgId)
		{
		/* ワンショットタイマタイムアウト */
		case LFW_MSGID_TIMER_TIMEOUT:
			DLOG_Debug("receive msgId = LFW_MSGID_TIMER_TIMEOUT.");

			timeoutMsg = (FrmTimeout_t*)msg;

			/* タイマID判定 */
			if (ERMC_TIMER_ID_MSG_RES == timeoutMsg->timerId) {
				DLOG_Debug("receive timerId = ERMC_TIMER_ID_MSG_RES.");

				if ((ERMC_PROC_STTS_WAITING == g_ermcProcStatus) ||
					(ERMC_PROC_STTS_SENDING == g_ermcProcStatus)) {
					/* 電文応答タイマタイムアウト */
					ermc_RecvMsgResTimerTimeOut();
				}
				else {
					/* 処理なし */
				}
			}
			else if(ERMC_TIMER_ID_RMC_COMM == timeoutMsg->timerId) {
				DLOG_Debug("receive timerId = ERMC_TIMER_ID_RMC_COMM.");

				/* OPリモコン通信タイマタイムアウト */
				ermc_RecvRmcCommTimerTimeOut();
			}
			else {
				/* 処理なし */
			}
			break;

		default:
			break;
		}
		break;

	default:
		DLOG_Error("unsupported attr:%d.", msg->attr);
		break;
	}

	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:終了処理を行う											*/
/*--------------------------------------------------------------------------*/
/*	param			:なし													*/
/*--------------------------------------------------------------------------*/
/*	return			:なし													*/
/*--------------------------------------------------------------------------*/
/*	detail			:なし													*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/03/24 : DHC KQ.Liang : 新規作成					*/
/*==========================================================================*/
void ERMC_Fin(void)
{
	DEBUG_TRCIN();

	/* 処理なし */

	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:起動処理を行う											*/
/*--------------------------------------------------------------------------*/
/*	param			:fact 起動要因											*/
/*--------------------------------------------------------------------------*/
/*	return			:なし													*/
/*--------------------------------------------------------------------------*/
/*	detail			:OPリモコン通信起動要求メッセージを送信する				*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/03/24 : DHC KQ.Liang : 新規作成					*/
/*==========================================================================*/
void ERMC_Start(slong fact)
{
	RmcCommStartReq_t sendMsg;

	DEBUG_TRCIN();

	/* 初期化 */
	memset(&sendMsg, 0u, sizeof(sendMsg));

	/* OPリモコン通信起動要求メッセージ送信 */
	sendMsg.header.msgId = ERMC_RMC_COMM_START_REQ;
	sendMsg.fact = fact;
	FRM_MsgSendAsync(ERMC_SPORT, sizeof(sendMsg), &sendMsg);

	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:停止処理を行う											*/
/*--------------------------------------------------------------------------*/
/*	param			:なし 													*/
/*--------------------------------------------------------------------------*/
/*	return			:なし													*/
/*--------------------------------------------------------------------------*/
/*	detail			:OPリモコン通信停止要求メッセージを送信する				*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/03/24 : DHC KQ.Liang : 新規作成					*/
/*==========================================================================*/
void ERMC_Stop(void)
{
	RmcCommStopReq_t sendMsg;

	DEBUG_TRCIN();

	/* 初期化 */
	memset(&sendMsg, 0u, sizeof(sendMsg));

	/* OPリモコン通信停止要求メッセージ送信 */
	sendMsg.header.msgId = ERMC_RMC_COMM_STOP_REQ;
	FRM_MsgSendAsync(ERMC_SPORT, sizeof(sendMsg), &sendMsg);

	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:OPリモコン通信状態を取得する							*/
/*--------------------------------------------------------------------------*/
/*	param			:commStatus OPリモコン通信状態							*/
/*--------------------------------------------------------------------------*/
/*	return			:なし													*/
/*--------------------------------------------------------------------------*/
/*	detail			:現在のOPリモコン通信状態を出力パラメータに設定する		*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/14 : DHC KQ.Liang : 新規作成					*/
/*==========================================================================*/
void ERMC_GetRmcCommStatus(ErmcRmcCommStatus_t* commStatus)
{
	DEBUG_TRCIN();

	/* OPリモコン通信状態を出力パラメータに設定 */
	*commStatus = g_ermcRmcCommStatus;

	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:INVマイコン初期化通信完了を通知する					*/
/*--------------------------------------------------------------------------*/
/*	param			:なし													*/
/*--------------------------------------------------------------------------*/
/*	return			:なし													*/
/*--------------------------------------------------------------------------*/
/*	detail			:INVマイコン初期化通信完了通知メッセージを送信する		*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/03/29 : DHC KQ.Liang : 新規作成					*/
/*==========================================================================*/
void ERMC_NotifyInvInitCommFin(void)
{
	InvInitCommFinNotify_t sendMsg;

	DEBUG_TRCIN();

	/* 初期化 */
	memset(&sendMsg, 0u, sizeof(sendMsg));

	/* INVマイコン初期化通信完了通知メッセージ送信 */
	sendMsg.header.msgId = ERMC_INV_INIT_COMM_FIN_NTY;
	FRM_MsgSendAsync(ERMC_SPORT, sizeof(sendMsg), &sendMsg);

	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:(CMD24)情報取得完了を通知する							*/
/*--------------------------------------------------------------------------*/
/*	param			:data 運転モード情報									*/
/*--------------------------------------------------------------------------*/
/*	return			:なし													*/
/*--------------------------------------------------------------------------*/
/*	detail			:(CMD24)情報取得完了通知メッセージを送信する			*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/03/31 : DHC KQ.Liang : 新規作成					*/
/*==========================================================================*/
void ERMC_NotifyCmd24DataInfo(EmdtrOpemodeGet_t* data)
{
	Cmd24InfoGetFinNty_t sendMsg;

	DEBUG_TRCIN();

	/* 初期化 */
	memset(&sendMsg, 0u, sizeof(sendMsg));

	/* (CMD24)情報取得完了通知メッセージ送信 */
	sendMsg.header.msgId = ERMC_CMD24_INFO_GET_FIN_NTY;
	memcpy(&sendMsg.dataInfo, data, sizeof(sendMsg.dataInfo));
	FRM_MsgSendAsync(ERMC_SPORT, sizeof(sendMsg), &sendMsg);

	DEBUG_TRCOUT();
}

/*--------------------------------------------------------------------------*/
/*	非公開関数定義															*/
/*--------------------------------------------------------------------------*/


/*End Of File*/
