/****************************************************************************/
/*	Description		:スレッド関連ラッパー関数								*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC Gu.CM												*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/05/09												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:														*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2020 NICHICON CORPORATION							*/
/****************************************************************************/

/*--------------------------------------------------------------------------*/
/*	Include Header File														*/
/*--------------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <pthread.h>
#include <errno.h>
#include <ctype.h>

#include "common_g.h"
#include "dlog_g.h"

/*--------------------------------------------------------------------------*/
/*	公開変数定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	非公開変数定義															*/
/*--------------------------------------------------------------------------*/
#ifdef CROSSDEBUG
#define CMN_MUTEX_INITIALIZER	PTHREAD_MUTEX_ERRORCHECK
#else
#define CMN_MUTEX_INITIALIZER	PTHREAD_MUTEX_ERRORCHECK_NP
#endif

/*--------------------------------------------------------------------------*/
/*	公開関数定義															*/
/*--------------------------------------------------------------------------*/
/*==========================================================================*/
/*	Description		:mutex初期化処理										*/
/*--------------------------------------------------------------------------*/
/*	param			:pthread_mutex_t *pmutex   mutexポインタ				*/
/*--------------------------------------------------------------------------*/
/*	return			:sint	処理結果										*/
/*					(0:正常/1:引数異常（ポインタNULL）						*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/03/22 : DHC Gu.CM : 新規作成						*/
/*==========================================================================*/
sint CMN_MutexInit(pthread_mutex_t *pmutex)
{
	pthread_mutexattr_t	attr;

	DEBUG_TRCIN();

	/* 引数確認 */
	if (NULL == pmutex)
	{
		DLOG_Debug("parameter NULL.\n");
		return -1;
	}

	/* attr 初期化 */
	pthread_mutexattr_init(&attr);
	/* タイプ設定 */
	pthread_mutexattr_settype(&attr, CMN_MUTEX_INITIALIZER);

	/* mutex 初期化 */
	pthread_mutex_init(pmutex, &attr);

	DEBUG_TRCOUT();

	return 0;
}

/*==========================================================================*/
/*	Description		:排他ロック処理											*/
/*--------------------------------------------------------------------------*/
/*	param			:pthread_mutex_t *pmutex;	mutexポインタ				*/
/*--------------------------------------------------------------------------*/
/*	return			:sint	処理結果										*/
/*					(0:正常/1:引数異常（ポインタNULL）						*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/03/22 : DHC Gu.CM : 新規作成						*/
/*==========================================================================*/
sint CMN_MutexLock(pthread_mutex_t *pmutex)
{
	sint ret;

	DEBUG_TRCIN();

	/* 引数確認 */
	if (NULL == pmutex)
	{
		DLOG_Debug("parameter NULL.\n");
		return -1;
	}

	/* ロック */
	ret = pthread_mutex_lock(pmutex);
	if (EINVAL == ret)
	{
		/* mutexが適切に初期化されていない */
		CMN_MutexInit(pmutex);
		/* 再ロック */
		pthread_mutex_lock(pmutex);
	}

	/* ret == EDEADLK の場合、既にそのスレッドでロックされているので何もしない */
	DEBUG_TRCOUT();

	return 0;
}

/*==========================================================================*/
/*	Description		:排他アンロック処理										*/
/*--------------------------------------------------------------------------*/
/*	param			:pthread_mutex_t *pmutex;	mutexポインタ				*/
/*--------------------------------------------------------------------------*/
/*	return			:sint	処理結果										*/
/*					(0:正常/-1:引数異常（ポインタNULL）						*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/03/22 : DHC Gu.CM : 新規作成						*/
/*==========================================================================*/
sint CMN_MutexUnlock(pthread_mutex_t *pmutex)
{
	sint ret;

	DEBUG_TRCIN();

	/* 引数確認 */
	if (NULL == pmutex)
	{
		DLOG_Debug("parameter NULL.\n");
		return -1;
	}

	/* アンロック */
	ret = pthread_mutex_unlock(pmutex);
	if (EINVAL == ret)
	{
		/* mutexが適切に初期化されていない */
		CMN_MutexInit( pmutex );
		/* 初期化後のmutexはアンロック状態 */
	}

	/* ret == EPERM の場合、そのスレッドではロックしていないので何もしない */

	DEBUG_TRCOUT();

	return 0;
}

/*--------------------------------------------------------------------------*/
/*	非公開関数定義															*/
/*--------------------------------------------------------------------------*/

/* End Of File */
