/******************************************************************************/
/*    Description    :時刻管理ミドル                                           */
/*----------------------------------------------------------------------------*/
/*    Author         :DHC Gu.CM                                              */
/*----------------------------------------------------------------------------*/
/*    Date           :2023/04/06                                              */
/*----------------------------------------------------------------------------*/
/*    Module Name    :                                                        */
/*----------------------------------------------------------------------------*/
/*    Note           :                                                        */
/*----------------------------------------------------------------------------*/
/*    Copyright      :(c) 2020 NICHICON CORPORATION                           */
/******************************************************************************/

/*----------------------------------------------------------------------------*/
/* Include Header File                                                        */
/*----------------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <errno.h>
#include <unistd.h>

#include <sys/types.h>
#include <sys/stat.h>
#include <sys/ioctl.h>
#include <fcntl.h>
#include <time.h>

#include "lfw_g.h"
#include "task_g.h"
#include "etim_g.h"
#include "etim_serv.h"
#include "etim_ntp.h"
#include "etim_utl.h"
#include "dlog_g.h"
#include "etim_rtc.h"
#include "etim_msg.h"

/*----------------------------------------------------------------------------*/
/* 公開変数定義                                                                */
/*----------------------------------------------------------------------------*/
extern bool_t g_etimRtcWriteEnable;				/* RTC書込み許可フラグ */
extern pthread_mutex_t g_etimRtcMutx;			/* RTCアクセス排他用 */
extern pthread_mutex_t g_etimSysCmdMutx;		/* system()実行排他用 */

/*----------------------------------------------------------------------------*/
/* 非公開変数定義                                                              */
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/* 公開関数定義                                                                */
/*----------------------------------------------------------------------------*/
void etim_RtcWriteTm(struct tm *ptm, int fd);
void etim_RtcReadTm(struct tm *ptm, int fd);
/*============================================================================*/
/*    Description    :RTC取得                                                 */
/*----------------------------------------------------------------------------*/
/*    param          :truct tm *ptm   時刻返却                                 */
/*----------------------------------------------------------------------------*/
/*    return         :sint	処理結果                                           */
/*                    (ETIM_OK(0):正常/                                        */
/*                     ETIM_E_SYSCALL(-1):システムコールエラー/                 */
/*                     ETIM_E_PARAM(-2):引数異常)                              */
/*----------------------------------------------------------------------------*/
/*    detail         :                                                        */
/*----------------------------------------------------------------------------*/
/*    history        :2023/04/06  : DHC Gu.CM : 新規作成                      */
/*============================================================================*/
sint ETIM_GetRtc(struct tm *ptm)
{
	sint fd;
	sint ret = ETIM_E_SYSCALL;

	DEBUG_TRCIN();

	/* 引数確認 */
	if (NULL == ptm)
	{
		DLOG_Error("parameter NULL.\n");
		DEBUG_TRCOUT();
		return ETIM_E_PARAM;
	}

	CMN_MutexLock(&g_etimRtcMutx);

	/* I2Cオープン */
	fd = ETIM_OPEN(ETIM_RTC_DEV_PATH, O_RDONLY, 0);
	if (ETIM_OK != fd)
	{
		DLOG_Error("ETIM_OPEN() error.\n");
	}
	else
	{
		/* 時刻レジスタ読み出し */
		etim_RtcReadTm(ptm, fd);

		ETIM_CLOSE(fd);
	}

	CMN_MutexUnlock(&g_etimRtcMutx);

	/* リターンを返す */
	DEBUG_TRCOUT();

	return ret;
}

/*============================================================================*/
/*    Description    :RTC設定                                                 */
/*----------------------------------------------------------------------------*/
/*    param          :                                                        */
/*----------------------------------------------------------------------------*/
/*    return         :sint	処理結果                                           */
/*                    (ETIM_OK(0):正常/                                        */
/*                     ETIM_E_SYSCALL(-1):システムコールエラ)                   */
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*    detail         :                                                        */
/*----------------------------------------------------------------------------*/
/*    history        :2023/04/06  : DHC Gu.CM : 新規作成                      */
/*============================================================================*/
sint ETIM_SetRtc(void)
{
	sint ret = ETIM_E_SYSCALL;
	struct timespec ts;
	struct tm tm;
	sint fd;

	DEBUG_TRCIN();

	/* 排他ロック */
	CMN_MutexLock(&g_etimRtcMutx);

	if (TRUE == g_etimRtcWriteEnable)
	{
		/* システム時刻取得 */
		ret = ETIM_ClockGetTime(CLOCK_REALTIME, &ts);
		if (ETIM_OK == ret)
		{
			/* 現在時刻をローカル時刻へ変換 */
			ret = ETIM_LocalTimeR(&ts.tv_sec, &tm);
			if (ETIM_OK == ret)
			{
				fd = ETIM_OPEN(ETIM_RTC_DEV_PATH, O_WRONLY, 0);
				if (ETIM_OK != fd)
				{
					DLOG_Error("ETIM_OPEN() error.\n");
				}
				else
				{
					/* 時刻レジスタ設定 */
					etim_RtcWriteTm(fd, &tm);

					ETIM_CLOSE(fd);
				}

				CMN_MutexLock(&g_etimSysCmdMutx);
				ret = system("hwclock --systohc --utc");
				CMN_MutexUnlock(&g_etimSysCmdMutx);

				if (0 != ret)
				{
					DLOG_Error("hwclock --systohc --utc error.\n");
				}
			}
			else
			{
				DLOG_Error("ETIM_LocalTimeR() error.\n");
			}
		}
		else
		{
			DLOG_Error("ETIM_ClockGetTime() error.\n");
		}
	}

	CMN_MutexUnlock( &g_etimRtcMutx );

	/* リターンを返す */
	DEBUG_TRCOUT();
	return ret;
}

/*----------------------------------------------------------------------------*/
/* 非公開関数定義                                                              */
/*----------------------------------------------------------------------------*/
/*==========================================================================*/
/*	Description		:读取RTC时间											*/
/*--------------------------------------------------------------------------*/
/*	param			:ptm	时间的结构体									*/
/*					:fd		文件描述符										*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/05/04 : DHC Gu.CM : 新規作成						*/
/*==========================================================================*/
void etim_RtcReadTm(struct tm *ptm, int fd)
{
	DEBUG_TRCIN();

	memset(ptm, 0, sizeof(*ptm));
	ioctl(fd, RTC_RD_TIME, ptm);
	ptm->tm_isdst = -1; /* "not known" */

	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:设置RTC时间											*/
/*--------------------------------------------------------------------------*/
/*	param			:ptm	时间的结构体									*/
/*					:fd		文件描述符										*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/05/04 : DHC Gu.CM : 新規作成						*/
/*==========================================================================*/
void etim_RtcWriteTm(struct tm *ptm, int fd)
{
	DEBUG_TRCIN();

	ioctl(fd, RTC_SET_TIME, ptm);

	DEBUG_TRCOUT();
}
/* End Of File */
