/****************************************************************************/
/*	Description		:FW更新機能 状態遷移制御								*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC.zhangs												*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/03/27												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:FW更新機能の機能名は、EOTAとす							*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2023 DHC CORPORATION								*/
/****************************************************************************/

/*--------------------------------------------------------------------------*/
/*	Include Header File														*/
/*--------------------------------------------------------------------------*/
#include "eota_log_g.h"
#include "task_g.h"
#include "eota_setting_g.h"
#include "lfw_g.h"
#include "frm_g.h"
#include "eota_data_g.h"
#include "eota_serv_g.h"
#include "eota_serv.h"
#include "eota_flow_g.h"
#include "eota_inv_g.h"

/*--------------------------------------------------------------------------*/
/*	公開変数定義															*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/*	非公開変数定義															*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/*	公開関数定義															*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/*	非公開関数定義															*/
/*--------------------------------------------------------------------------*/
void * EOTA_CommThreadStartDownload(void *arg);

/*==========================================================================*/
/*	Description		:	FW更新開始処理										*/
/*--------------------------------------------------------------------------*/
/*	param			:	tmp_bootState 起動状態								*/
/*--------------------------------------------------------------------------*/
/*	return			:	EOTA_OK                 正常終了					*/
/*--------------------------------------------------------------------------*/
/*	detail			:	EEPC起動時処理										*/
/*--------------------------------------------------------------------------*/
/*	history			:	2023/03/20 : DHC.zhangs : 新規作成					*/
/*==========================================================================*/
slong EOTA_Start(uchar tmp_bootState)
{
	DEBUG_TRCIN();

	DEBUG_TRCOUT();

	return (slong)(0);
}

/*==========================================================================*/
/*	Description		:	FW更新初期化処理									*/
/*--------------------------------------------------------------------------*/
/*	param			:	無し												*/
/*--------------------------------------------------------------------------*/
/*	return			:	無し												*/
/*--------------------------------------------------------------------------*/
/*	detail			:	FW更新初期化処理を実施する							*/
/*--------------------------------------------------------------------------*/
/*	history			:	2023/03/20 : DHC.zhangs : 新規作成					*/
/*==========================================================================*/
void EOTA_Init(void)
{
	DEBUG_TRCIN();
	/* グローバル変数初期化 */
	EOTA_DataIni();
	/* V:FW 更新状態 0:待機 */
	EOTA_SetUpdateState(EOTA_UPD_WAIT);

	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:	FW更新送受信メッセージ処理							*/
/*--------------------------------------------------------------------------*/
/*	param			:	Msg メッセージ										*/
/*--------------------------------------------------------------------------*/
/*	return			:	無し												*/
/*--------------------------------------------------------------------------*/
/*	detail			:	FW更新送受信メッセージを実施する					*/
/*--------------------------------------------------------------------------*/
/*	history			:	2023/03/20 : DHC.zhangs : 新規作成					*/
/*==========================================================================*/
void EOTA_MsgProc(FrmMsgHead_t const * Msg)		/* [i] メッセージ */
{
	DEBUG_TRCIN();

	EOTA_START_T * 		StartMsg   = NULL;
	FrmTimeout_t const *TimeoutMsg = NULL;
	FrmPthread_t Thread = 0UL;	/* スレッド */
	slong threadRet = 0L;

	switch(Msg->attr)
	{
	/* 非同期メッセージ */
	case FRM_MSG_ASYNC:
		switch(Msg->msgId)
		{
		/* FW更新開始 */
		case EOTA_MSGID_START:
			/* グローバル変数初期化 */
			EOTA_DataIni();
			StartMsg = (EOTA_START_T *)Msg;
			/* ダウンロード経由設定 */
			EOTA_SetDownSrc(StartMsg->fwStartMode);
			/* FW 更新実施状態設定 */
			EOTA_SetRunState(EOTA_RUN_STATE_S);
			/* V:FW 更新状態 1:ダウンロード・解析 */
			EOTA_SetUpdateState(EOTA_UPD_DOWN);
			/* INV通信スレッド生成 */
			threadRet = FRM_PthreadCreate(&Thread, NULL, EOTA_CommThreadStartDownload, NULL);
			if (threadRet != FRM_SUCCESS)
			{
				DLOG_Error("EOTA_MsgProc FRM_PthreadCreate fail\n");
			} 
			else
			{
				/* 処理無し */
			}

			break;

		case EOTA_MSGID_STOP:
			/* 更新中止状態設定 */
			EOTA_SetUpdStop(EOTA_UPDATE_STOP_ON);
			break;

		case EOTA_MSGID_CMD60_REQ:
			/*  TODO. (条件追加必要) */
			/* 次の部品を更新する */
			EOTA_Flow();
			break;

		case EOTA_MSGID_SEND_CMD64:
			/* CMD64送信	*/
			eota_SendCmd64();
			break;

		case EOTA_MSGID_CMD64_TIMEOUT:
			/* CMD64 60s Timeout	*/
			eota_Cmd64TimeOut();
			break;

		case EOTA_MSGID_CMD64_REQ:
			/* CMD64結果受信 	*/
			eota_GetCmd64Result(Msg);
			break;

		case EOTA_MSGID_CMD65_REQ:
			/* CMD65結果受信	*/
			eota_GetCmd65Result(Msg);
			break;

		case EOTA_MSGID_USE_UPD:
			/* Time起動必要 TODO. */
			break;

		default:
			// DLOG_Debug("--unknown async msgId : %d--\n",Msg->msgId);
			break;
		}
		break;

	/* イベントメッセージ */
	case FRM_MSG_EVENT:
		switch(Msg->msgId)
		{
		case EOTA_TIMEID_INV_RES:
			TimeoutMsg = (FrmTimeout_t const *)Msg;

			/* 一回応答タイム */
			if (EOTA_TIMEID_INV_RES == TimeoutMsg->timerId)
			{
				EOTA_TimeOutRes();
			}
			/* 通信タイムアウト */
			else if (EOTA_TIMEID_INV_TIME_OUT == TimeoutMsg->timerId)
			{
				EOTA_TimeOutInv();
			}
			else if(EOTA_TIMEID_MODE_F_TIME == TimeoutMsg->timerId)
			{
				EOTA_Flow();
			}
			else
			{
				/* 処理無し */
			}

			break;

		default:
			break;
		}
	default:
		// DLOG_Debug("--unknown attr : %d--\n",Msg->attr);
		break;
	}

	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:	FW更新終了処理										*/
/*--------------------------------------------------------------------------*/
/*	param			:	無し												*/
/*--------------------------------------------------------------------------*/
/*	return			:	無し												*/
/*--------------------------------------------------------------------------*/
/*	detail			:	FW更新終了処理を実施する							*/
/*--------------------------------------------------------------------------*/
/*	history			:	2023/03/20 : DHC.zhangs : 新規作成					*/
/*==========================================================================*/
void EOTA_Fin(void)
{
	DEBUG_TRCIN();

	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:	FW更新終了処理										*/
/*--------------------------------------------------------------------------*/
/*	param			:	無い												*/
/*--------------------------------------------------------------------------*/
/*	return			:	0固定												*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:	2023/03/14 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
slong EOTA_Stop(void)
{
	DEBUG_TRCIN();

	DEBUG_TRCOUT();

	return (slong)(0);
}

/*--------------------------------------------------------------------------*/
/*	非公開関数定義															*/
/*--------------------------------------------------------------------------*/

/*==========================================================================*/
/*	Description	:ダウンロード解析スレッド									*/
/*--------------------------------------------------------------------------*/
/*	param		:arg		:NULL指定										*/
/*--------------------------------------------------------------------------*/
/*	return		:NULL														*/
/*--------------------------------------------------------------------------*/
/*	detail		:ダウンロード解析処理を行う。								*/
/*--------------------------------------------------------------------------*/
/*	history		：2023/05/05 : DHC lib : 新規作成							*/
/*==========================================================================*/
void * EOTA_CommThreadStartDownload(void *arg)
{
	DEBUG_TRCIN();

	/* 状態遷移 */
	EOTA_Flow();

	DEBUG_TRCOUT();

    pthread_exit(NULL);
}
