/****************************************************************************/
/*	Description		:FW更新機能 モジュール間処理ヘッダファイル				*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC.zhangs												*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/03/20												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:FW更新機能の機能名は、EOTAとす							*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2023 DHC CORPORATION								*/
/****************************************************************************/
#ifndef	__EOTA_SERV_H__
#define	__EOTA_SERV_H__

/*--------------------------------------------------------------------------*/
/* マクロ定義																*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	公開型宣言、定義														*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/* 非公開型宣言、定義														*/
/*--------------------------------------------------------------------------*/
/* 開始メッセージ */
typedef struct _eota_start_t
{
	FrmMsgHead_t Header;						/* メッセージヘッダファイル		*/
	uchar		 fwStartMode;					/* 開始モード					*/
} EOTA_START_T;

/* 終了メッセージ */
typedef struct _eota_stop_t
{
	FrmMsgHead_t Header;			/* メッセージヘッダファイル		*/

} EOTA_STOP_T;

/* ユーザ更新時点 */
typedef struct _eota_use_upd_t
{
	FrmMsgHead_t Header;			/* メッセージヘッダファイル		*/

	uchar        UpdPoint;			/* 更新時点						*/
	
} EOTA_USE_UPD_T;

/* CMD11 受信 Dataメッセージ */
typedef struct _eota_cmd11_data_t
{
	FrmMsgHead_t Header;			/* メッセージヘッダファイル		*/
	/* TODO. */
} EOTA_CMD11_DATA_T;

/* CMD64 受信 Dataメッセージ */
typedef struct _eota_cmd64_data_t
{
	FrmMsgHead_t Header;			/* メッセージヘッダファイル		*/
	uchar startOrStop;				/* 運転／停止 "0":停止, "1":運転 */
} EOTA_CMD64_DATA_T;

/* CMD65 受信 Dataメッセージ */
typedef struct _eota_cmd65_data_t
{
	FrmMsgHead_t Header;			/* メッセージヘッダファイル		*/
	char ret;						/* 0:OK 0以外：NG*/
} EOTA_CMD65_DATA_T;

/* プロセス間通信要求共用体 */
typedef union _eota_msg_par_u{
	FrmMsgHead_t								header;
	EOTA_START_T								start;
	EOTA_STOP_T									stop;
	EOTA_CMD11_DATA_T							cmd11_data;
	EOTA_CMD64_DATA_T							cmd64_data;
	EOTA_CMD65_DATA_T							cmd65_data;
}EotaMsgPar_t;

/*--------------------------------------------------------------------------*/
/* 定数宣言、定義															*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* 変数宣言、定義															*/
/*--------------------------------------------------------------------------*/



/*--------------------------------------------------------------------------*/
/* プロトタイプ宣言															*/
/*--------------------------------------------------------------------------*/

#endif	/* __EOTA_SERV_H__ */
