/****************************************************************************/
/*	Description		:FW更新機能 各設定値チェックヘッダファイル				*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC.zhangs												*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/03/20												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:FW更新機能の機能名は、EOTAとす							*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2023 DHC CORPORATION								*/
/****************************************************************************/
#ifndef	__EOTA_CHECK_H__
#define	__EOTA_CHECK_H__

/*--------------------------------------------------------------------------*/
/*	Include Header File														*/
/*--------------------------------------------------------------------------*/
#include "typedef.h"

/*--------------------------------------------------------------------------*/
/* マクロ定義																*/
/*--------------------------------------------------------------------------*/
/* FW 更新の圧縮ファイル */
#define EOTA_PKG_TGZ_NAME			((schar *)"E1FW_PKG_v")
												/* 圧縮ファイル名			*/
#define EOTA_PKG_TGZ_EXT			((schar *)".tgz")
												/* 圧縮拡張子				*/
#define EOTA_E1FW_PKG_V_SIZE		((uchar)10u)
												/* E1FW_PKG_v サイズ		*/
#define EOTA_PKG_NUM_SIZE			((uchar)3u)	/* 半角英数字 3 文字		*/

/* FW 更新指示ファイル */
#define EOTA_SETUP_MODE_F			((schar *)"F")
												/* MODE 強制的に FW 更新	*/
#define EOTA_SETUP_MODE_U			((schar *)"U")
												/* MODE スマホアプリ FW更新	*/
#define EOTA_SETUP_MODE_C			((schar *)"C")
												/* MODE 更新待ち FW			*/

#define EOTA_SETUP_TGT_MIN			((uchar)0u)	/* FW 更新対象と順番 最小値	*/
#define EOTA_SETUP_TGT_MAX			((uchar)5u)	/* FW 更新対象と順番 最大値	*/
#define EOTA_SETUP_TGT_NUM_1		((schar)'1')
												/* 番号1					*/
#define EOTA_SETUP_TGT_NUM_2		((schar)'2')
												/* 番号2					*/
#define EOTA_SETUP_TGT_NUM_3		((schar)'3')
												/* 番号3					*/
#define EOTA_SETUP_TGT_NUM_4		((schar)'4')
												/* 番号4					*/
#define EOTA_SETUP_TGT_NUM_5		((schar)'5')
												/* 番号5					*/
#define EOTA_SETUP_TGT_ALL_0		((schar *)"00000")
												/* TGTの値が全て0でない		*/

#define EOTA_SETUP_TIME_LEN			((uchar)11u)
												/* 時間 サイズ				*/
#define EOTA_SETUP_TIME_UNDER		((schar *)"_")
												/* 時間 下線				*/
#define EOTA_SETUP_TIME_F_LEN		((uchar)6u)	/* 時間下線前のイズ			*/
#define EOTA_SETUP_TIME_B_LEN		((uchar)4u)	/* 時間下線後のサイズ		*/

#define EOTA_SETUP_FW_MODEL_E1 		((schar *)"fw_model_e1")
												/* fw_model_e1				*/

#define EOTA_FILE_CMD_MD5SUM		((schar *)"md5sum")
												/* MD5チェックサム			*/
#define EOTA_CMD_BUFSIZE			((ushort)512u)
												/* コマンドバッファサイズ	*/
#define EOTA_TIME_YEAR_SIZE			((ushort)4u)
												/* 文字列(年)サイズ			*/

/*--------------------------------------------------------------------------*/
/* 非公開型宣言、定義														*/
/*--------------------------------------------------------------------------*/
/* データ存在フラグ */
enum
{
	EOTA_DATA_EXIT = 0,				  /* 0:存在					*/
	EOTA_DATA_NOT_EXIT,				  /* 1:存在なし				*/
};

/*--------------------------------------------------------------------------*/
/* 定数宣言、定義															*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* 変数宣言、定義															*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* プロトタイプ宣言															*/
/*--------------------------------------------------------------------------*/

#endif	/* __EOTA_CHECK_H__ */
