/****************************************************************************/
/*	Description		:FW更新機能 処理流れヘッダファイル						*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC.zhangs												*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/03/20												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:FW更新機能の機能名は、EOTAとす							*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2023 DHC CORPORATION								*/
/****************************************************************************/
#ifndef	__EOTA_FLOW_H__
#define	__EOTA_FLOW_H__

#include "typedef.h"

/*--------------------------------------------------------------------------*/
/* マクロ定義																*/
/*--------------------------------------------------------------------------*/
/* 進捗率 */
#define EOTA_PRO_RATE_DOWN_ING		((uchar)10u)	/* 進捗率(ダウンロード)	*/
#define EOTA_PRO_RATE_ANA_ING		((uchar)60u)	/* 進捗率(解析中)		*/
#define EOTA_PRO_RATE_ANA_END		((uchar)100u)	/* 進捗率(解析完了)		*/

/*--------------------------------------------------------------------------*/
/* 非公開型宣言、定義														*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* 定数宣言、定義															*/
/*--------------------------------------------------------------------------*/
/* ワンショットタイマID */
typedef enum _eota_tim_id_e{
	EOTA_TIM_ID_CMD64			= (ulong)1000,				/* CMD64を1s毎に送信 */
	EOTA_TIM_ID_CMD64_TIMEOUT	= (ulong)60000,				/* CMD64 timeout 60s */
}EotaTimid_t;

/*--------------------------------------------------------------------------*/
/* 変数宣言、定義															*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* プロトタイプ宣言															*/
/*--------------------------------------------------------------------------*/
/* 待機 */
static void eota_Wait(void);
/* ダウンロード・解析 */
static schar eota_DownAnaly(void);
/* ダウンロード(USB 経由) */
static schar eota_DownloadUSB(void);
/* ダウンロード(見守り経由) */
static void eota_DownloadSUB(void);
/* ダウンロード(スマホアプリ経由) */
static schar eota_DownloadAPP(void);
/* ダウンロード(USB 経由 かつ タクト SW経由) */
static schar eota_DownloadSW(void);
/* ファイル解析 */
static void eota_Analyze(const schar * FileName);
/* FW 更新開始 */
static void eota_UpdateStart(void);
/* FW 更新中 */
static uchar eota_Update(void);
/* FW 更新終了 */
static void eota_UpdateEnd(void);

#endif	/* __EOTA_FLOW_H__ */
