/****************************************************************************/
/*	Description		:FW更新機能 各設定値チェックヘッダファイル				*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC.zhangs												*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/03/20												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:FW更新機能の機能名は、EOTAとす							*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2023 DHC CORPORATION								*/
/****************************************************************************/
#ifndef	__EOTA_CHECK_G_H__
#define	__EOTA_CHECK_G_H__

/*--------------------------------------------------------------------------*/
/*	Include Header File														*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* マクロ定義																*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* 非公開型宣言、定義														*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* 定数宣言、定義															*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* 変数宣言、定義															*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* プロトタイプ宣言															*/
/*--------------------------------------------------------------------------*/
/* 10進チェック */
extern uchar EOTA_is_digit(const schar * pData);
/* 圧縮ファイル名チェック */
extern uchar EOTA_CheckTarFile(const schar * TarName, ushort * Number);
/* FW 更新指示ファイルのNO項目チェック */
extern uchar EOTA_CheckSetupNO(const schar * No);
/* FW 更新指示ファイルのTYPE項目チェック */
extern uchar EOTA_CheckSetupType(const schar * Type);
/* FW 更新指示ファイルのMODE項目チェック */
extern uchar EOTA_CheckSetupMode(const schar * Mode, uchar * UpdateMode);
/* FW 更新指示ファイルのTGT設定値チェック */
extern uchar EOTA_CheckSetupTGTValue(const schar * Tgt);
/* FW 更新指示ファイルのTGT項目チェック */
extern uchar EOTA_CheckSetupTGT(const schar * Tgt, uchar Type, schar * List);
/* FW 更新指示ファイルのTGT連続チェック */
extern uchar EOTA_CheckSetupTGTOrder(const schar * List);
/* FW 更新指示ファイルのTGT全て0チェック */
extern uchar EOTA_CheckSetupTGTAllZero(const schar * List);
/* FW 更新指示ファイルのTIME項目チェック */
extern uchar EOTA_CheckSetupTime(const schar * Time);
/* FW 更新指示ファイルのバージョンチェック */
extern uchar EOTA_CheckUpdateVersion(const schar * UpdVer, const schar * CurVer);
/* FW 更新指示ファイルのMD5ハッシュ値チェック */
extern uchar EOTA_CheckMD5(const schar * Md5File);
/* 更新時間チェック */
extern uchar EOTA_UpdateCheckTime(const schar * UpdateTime);

#endif	/* __EOTA_CHECK_G_H__ */
