/****************************************************************************/
/*	Description		:FW更新機能 ファイル操作ヘッダファイル					*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC.zhangs												*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/03/20												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:FW更新機能の機能名は、EOTAとす							*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2023 DHC CORPORATION								*/
/****************************************************************************/
#ifndef	__EOTA_FILE_G_H__
#define	__EOTA_FILE_G_H__

#include "typedef.h"
#include "eota_setting_g.h"

/*--------------------------------------------------------------------------*/
/* マクロ定義																*/
/*--------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------*/
/* 非公開型宣言、定義														*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* 定数宣言、定義															*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* 変数宣言、定義															*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/* プロトタイプ宣言															*/
/*--------------------------------------------------------------------------*/
/* 圧縮ファイル取得 */
extern uchar EOTA_GetTarFile(const schar * BasePath, schar * TarFile);
/* 圧縮ファイル解凍 */
extern uchar EOTA_TarunZip(const schar * TgzFilePath);
/* FW 更新指示ファイル取得 */
extern uchar EOTA_GetUpdateSetupFile(const schar * FilePath, EOTA_UPDATE_SETUP_T * UpdateSetup);
/* 既存の FW 更新ファイル削除 */
extern uchar EOTA_DelFWFile(const schar * BasePath);
/* FW 更新の圧縮ファイルダウンロード */
extern uchar EOTA_TarCopy(const schar * Src, const schar * Dst);
/* ファイルサイズ取得 */
extern slong EOTA_GetFileSize(const schar * Path);
/* ファイルデータ取得 */
extern uchar EOTA_GetFileData(const schar * Path, slong Offset, size_t * Len, uchar * Data);

#endif	/* __EOTA_FILE_G_H__ */
