/****************************************************************************/
/*	Description		:														*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC Chen.H												*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/04/25												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:														*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2020 NICHICON CORPORATION							*/
/****************************************************************************/
#ifndef __WDT_FNC_G_H__
#define __WDT_FNC_G_H__
#include "wdt_g.h"
/*--------------------------------------------------------------------------*/
/*	マクロ定義																*/
/*--------------------------------------------------------------------------*/
#define WDT_DEBUG_LOG_DIR				"/mnt/log/debug_log"
#define WDT_DEBUG_LOG_SWITCH_FILE		"/mnt/log/debug_log/debug_switch.txt"
#define WDT_DEBUG_LOG_ON				'1'
#define WDT_DEBUG_LOG_OFF				'0'
#define WDT_DEBUG_LOG_PREFIX			"wdtlog"
#define WDT_DEBUG_LOG_MAX_SZ			((ulong)1024u * 1024u)
#define WDT_DEBUG_LOG_MAX_NUM			((ulong)5u)
#define WDT_DEBUG_LOG_CRT_INTERVAL_S	((ulong)3600u)

/*--------------------------------------------------------------------------*/
/*	公開型宣言、定義														*/
/*--------------------------------------------------------------------------*/
/* 時刻設定・取得データ */
typedef struct {
	sint tmSec;					/* 秒（0～60）※60は閏秒のため */
	sint tmMin;					/* 分（0～59）*/
	sint tmHour;				/* 時（0～23）*/
	sint tmMday;				/* 日（1～31）*/
	sint tmMon;					/* 月（1～12）*/
	sint tmYear;				/* 年（1900～2037）※西暦年 */
} WdtTm_t;

/*--------------------------------------------------------------------------*/
/*	定数宣言、定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	変数宣言																*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	プロトタイプ宣言														*/
/*--------------------------------------------------------------------------*/
extern void wdt_FncWdtRes(ulong sport, uchar timeout);
extern void wdt_FncTermReq(WdtTermType_t type, ulong reqMsgid);
extern void wdt_FncTermRes(ulong sport, WdtTermType_t type);
extern slong wdt_GetTime(WdtTm_t *pTime);
extern void wdt_DebugLogProc(void);
#endif /*__WDT_FNC_G_H__*/
