/****************************************************************************/
/*	Description		:WATCHDOG監視プロセスグローバル変数							*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC Chen.H											*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/03/28												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:WDT													*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2020 NICHICON CORPORATION							*/
/****************************************************************************/

/*--------------------------------------------------------------------------*/
/*	Include Header File														*/
/*--------------------------------------------------------------------------*/
#include "task_g.h"
#include "wdt_cmn_g.h"

/*--------------------------------------------------------------------------*/
/*	公開変数定義															*/
/*--------------------------------------------------------------------------*/
sint g_wdtFd;			/* WATCHDOGタイマデバイスファイルディスクリプタ */
pthread_mutex_t	g_wdtMtx;	/* 内部排他用ミューテックス */

/* プロセス監視用テーブル */
const WdtProcTbl_t	g_wdtProcTbl[WDT_PROC_TBL_NUM] = {
	{"E1BoardApp",		ESYS_SPORT}
};

uchar g_wdtProcWdtCnt[PROCESS_MAX];		/* プロセス生存カウンタ */
uchar g_wdtProcWdtResFlg[PROCESS_MAX];	/* WDT応答受信フラグ */
uchar g_wdtProcWdtSndFlg[PROCESS_MAX];	/* WDT応答要求送信フラグ */

WdtTermType_t g_wdtTermType;				/* 現在の終了種別 */
uchar g_wdtTermTimeoutCnt;				/* 終了タイムアウトカウント値 */
uchar g_wdtProcTermResFlg[PROCESS_MAX];	/* 終了応答受信フラグ */
uchar g_wdtProcTermFinishFlg;				/* 全プロセス終了フラグ */
uchar g_wdtPwSwOffDetectCnt;				/* 電源SW OFF判定カウンタ */
bool_t g_wdtMemChkFlg;			/* メモリキャッシュクリアチェックフラグ */
ulong g_wdtMemChkTimErrCnt;/* メモリキャッシュチェック時の時刻取得失敗カウント */

/*--------------------------------------------------------------------------*/
/*	非公開変数定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	公開関数定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	非公開関数定義															*/
/*--------------------------------------------------------------------------*/


/*End Of File*/
