/****************************************************************************/
/*	Description		:WATCHDOG監視プロセス内部ヘッダ							*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC Chen.H												*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/04/25												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:wdt													*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2020 NICHICON CORPORATION							*/
/****************************************************************************/
#ifndef __WDT_CMN_G_H__
#define __WDT_CMN_G_H__
#include <pthread.h>
#include "wdt_g.h"
#include "dlog_g.h"
/*--------------------------------------------------------------------------*/
/*	マクロ定義																*/
/*--------------------------------------------------------------------------*/
/* WATCHDOGタイマデバイスPATH */
#define	WDT_WDT_DEV_PATH			"/dev/watchdog"
/* WATCHDOGタイマタイムアウト時間(秒) */
#define	WDT_SYS_TIMEOUT				((ulong)120u)
/* サブスレッド実行周期(us) */
#define	WDT_CYC_TIME				((ulong)(50u * 1000u))
/* WATCHDOGタイマクリア周期(カウント値) */
#define	WDT_KEEPALIVE_CYC_CNT		\
				(ulong)((ulong)(20u * 1000u * 1000u) / (ulong)WDT_CYC_TIME)
/* 常駐プロセス生存確認周期(カウント値) */
#define	WDT_PROC_CHK_CYC_CNT		\
				(ulong)((ulong)(1u * 1000u * 1000u) / (ulong)WDT_CYC_TIME)
/* 終了監視周期(カウント値) */
#define	WDT_TERM_CHK_CYC_CNT		\
				(ulong)((ulong)(1u * 1000u * 1000u) / (ulong)WDT_CYC_TIME)
/* メモリキャッシュクリア監視周期(カウント値) */
#define	WDT_MEM_CHK_CYC_CNT			\
				(ulong)((ulong)(60u * 1000u * 1000u) / (ulong)WDT_CYC_TIME)
/* メモリキャッシュクリア実行時刻(AM3時) */
#define	WDT_MEM_CLR_HOUR			((ulong)3u)
/* メモリキャッシュクリア時の時刻取得失敗カウント(24時間分) */
#define	WDT_MEM_TIM_ERR_CNT			((ulong)(60u * 24u))
/* 常駐プロセスタイムアウト時間(最小値) */
#define	WDT_PROC_TIMEOUT_MIN		((ulong)2u)
/* 常駐プロセスタイムアウト時間(最大値) */
#define	WDT_PROC_TIMEOUT_MAX		((ulong)10u)
/* 終了監視タイムアウト時間(カウント値) */
#define	WDT_TERM_TIMEOUT			((ulong)WDT_PROC_TIMEOUT_DEF * 2u)
/* 終了処理中の常駐プロセスタイムアウト時間 */
#define	WDT_PROC_TIMEOUT_TERM		((ulong)WDT_TERM_TIMEOUT / 2u)
/* 電源SW OFF判定一致回数 */
#define	WDT_PWSW_OFF_DETECT_CNT		((ulong)3u)
/* プロセス削除コマンド書式 */
#define	WDT_PROC_KILL_CMD			"killall -KILL %s"
/* プロセス起動コマンド書式(GUI以外) */
#define	WDT_PROC_EXE_CMD			"/bin/%s 1 &"
/* プロセス削除/起動コマンド文字列バッファ長 */
#define	WDT_CMD_BUF_LEN				((ulong)256u)
/* プロセス監視テーブル要素数 */
#define	WDT_PROC_TBL_NUM			((ulong)1u)
/* 内部フラグ設定値(フラグOFF) */
#define	WDT_FLG_OFF					((ulong)0x00u)
/* 内部フラグ設定値(フラグON) */
#define	WDT_FLG_ON					((ulong)0x01u)
/* プロセス名文字列バッファ長 */
#define WDT_PROCESS_NAME_MAX_LEN	((ulong)16u)
/*--------------------------------------------------------------------------*/
/*	公開型宣言、定義														*/
/*--------------------------------------------------------------------------*/
/***********************************************************
* @struct	WdtProcTbl_t
* @brief	プロセス監視用テーブル構造
************************************************************/
typedef struct {
	schar name[WDT_PROCESS_NAME_MAX_LEN];		/* プロセス名 */
	ulong sport;								/* メッセージキューID */
} WdtProcTbl_t;


/*--------------------------------------------------------------------------*/
/*	定数宣言、定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	変数宣言																*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	プロトタイプ宣言														*/
/*--------------------------------------------------------------------------*/


#endif /*__WDT_CMN_G_H__*/
