/****************************************************************************/
/*	Description		:リモコン用キー入力制御プロセス公開ヘッダーファイル		*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC Cao.HZ												*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/03/16												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:EKEY													*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2020 NICHICON CORPORATION							*/
/****************************************************************************/
#ifndef __EKEY_G_H__
#define __EKEY_G_H__
/*--------------------------------------------------------------------------*/
/*	Include Header File														*/
/*--------------------------------------------------------------------------*/
#include "typedef.h"
#include "frm_g.h"
/*--------------------------------------------------------------------------*/
/*	定数宣言、定義															*/
/*--------------------------------------------------------------------------*/
typedef enum {
	EKEY_BTN_SW1 = 0u,
	EKEY_BTN_SW2,
	EKEY_PIN_A8,
	EKEY_PIN_D10,
	EKEY_PIN_A14,
	EKEY_PIN_K17,
	EKEY_BTN_MAX,
} EKEY_Btn_t;

typedef enum {
	EKEY_BTNEVENT_PRESS = 0u,		/* ボタン押下					*/
	EKEY_BTNEVENT_RELEASE,			/* ボタン押下解除（短押し）		*/
	EKEY_BTNEVENT_LONG_PRESS,		/* ボタン押下3秒経過（長押し）	*/
	EKEY_BTNEVENT_LONG_RELEASE,		/* ボタン押下3秒経過後の解除	*/
} EKEY_BtnEvent_t;

/*--------------------------------------------------------------------------*/
/*	プロトタイプ宣言														*/
/*--------------------------------------------------------------------------*/
extern void EKEY_Init(void);
extern void EKEY_MsgProc(FrmMsgHead_t const *msg);
extern void EKEY_Fin(void);
extern slong EKEY_Start(slong fact);
extern slong EKEY_Stop(void);

extern void EKEY_BtnCancel(EKEY_Btn_t btn);

#endif /*__EKEY_H__*/

