/****************************************************************************/
/*	Description		:EENL ファイル入出力 ヘッダ								*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC DX.zhao											*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/04/12												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:ECHONET Lite通信の機能名は、EENLとする					*/
/*--------------------------------------------------------------------------*/
/*	Note			:無し													*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2023 NICHICON CORPORATION							*/
/****************************************************************************/

#ifndef __EENL_CMNFILE_G_H__
#define __EENL_CMNFILE_G_H__

/*--------------------------------------------------------------------------*/
/*	プロトタイプ宣言														*/
/*--------------------------------------------------------------------------*/

extern slong EENL_CmnFileWrite(schar* filename, void* data, ulong size);
extern slong EENL_CmnFileRead(schar* filename, void* data, ulong size);
extern slong EENL_FileInit(void);
extern slong EENL_FileWrite(void);
extern slong EENL_FileRead(void);

#endif /* __EENL_CMNFILE_G_H__ */
