/****************************************************************************/
/*	Description		:WATCHDOG監視プロセスグローバル変数							*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC Chen.H											*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/03/28												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:EWDT													*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2020 NICHICON CORPORATION							*/
/****************************************************************************/

/*--------------------------------------------------------------------------*/
/*	Include Header File														*/
/*--------------------------------------------------------------------------*/
#include <task_g.h>
#include "ewdt_local.h"

/*--------------------------------------------------------------------------*/
/*	公開変数定義															*/
/*--------------------------------------------------------------------------*/
sint g_EWDT_WdtFd;						/* WATCHDOGタイマデバイスファイルディスクリプタ */
pthread_mutex_t	g_EWDT_Mtx;				/* 内部排他用ミューテックス */

const EwdtProcTbl_t	g_EWDT_ProcTbl[EWDT_PROC_TBL_NUM] = {	/* プロセス監視用テーブル */
	{"eini",	EINI_SPORT},
	{"elog",	ELOG_SPORT},
	{"etim",	ETIM_SPORT},
	{"epcs",	EPCS_SPORT},
	{"eled",	ELED_SPORT},
	{"enet",	ENET_SPORT},
	{"eepc",	EEPC_SPORT},
	{"esch",	ESCH_SPORT},
	{"eenl",	EENL_SPORT},
	{"elcd",	ELCD_SPORT},	// T3で新規追加
	{"ekey",	EKEY_SPORT},	// T3で新規追加
	{"alcd",	ALCD_SPORT}		// T3で新規追加
};

uchar g_EWDT_ProcWdtCnt[PROCESS_MAX];		/* プロセス生存カウンタ */
uchar g_EWDT_ProcWdtResFlg[PROCESS_MAX];	/* WDT応答受信フラグ */
uchar g_EWDT_ProcWdtSndFlg[PROCESS_MAX];	/* WDT応答要求送信フラグ */

EwdtTermType_t g_EWDT_TermType;				/* 現在の終了種別 */
uchar g_EWDT_TermTimeoutCnt;				/* 終了タイムアウトカウント値 */
uchar g_EWDT_ProcTermResFlg[PROCESS_MAX];	/* 終了応答受信フラグ */
uchar g_EWDT_ProcTermFinishFlg;				/* 全プロセス終了フラグ */
uchar g_EWDT_PwSwOffDetectCnt;				/* 電源SW OFF判定カウンタ */
bool_t g_EWDT_MemChkFlg;					/* メモリキャッシュクリアチェックフラグ */
ulong g_EWDT_MemChkTimErrCnt;				/* メモリキャッシュチェック時の時刻取得失敗カウント */

/*--------------------------------------------------------------------------*/
/*	非公開変数定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	公開関数定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	非公開関数定義															*/
/*--------------------------------------------------------------------------*/


/*End Of File*/
