/****************************************************************************/
/*	Description		:														*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC jingtong.li										*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/04/14												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:														*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2020 NICHICON CORPORATION							*/
/****************************************************************************/

/*--------------------------------------------------------------------------*/
/*	Include Header File														*/
/*--------------------------------------------------------------------------*/
#include <task_g.h>
#include "edat_serv_g.h"
#include "dlog_g.h"
#include "edat_val_g.h"
/*--------------------------------------------------------------------------*/
/*	公開変数定義															*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/*	非公開変数定義															*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/*	公開関数定義															*/
/*--------------------------------------------------------------------------*/
/*==========================================================================*/
/*	Description		:设置类型为通信ボード的错误信息							*/
/*--------------------------------------------------------------------------*/
/*	param			:schar const *errCode	错误代码						*/
/*					schar errCodeRating		错误等级						*/
/*--------------------------------------------------------------------------*/
/*	return			:slong	処理結果										*/
/*						0	正常	-1	異常								*/
/*--------------------------------------------------------------------------*/
/*	detail			:设置类型为通信ボード的错误信息							*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/14 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
slong EDAT_SetBoardErr(schar const *errCode, schar errCodeRating)
{
	EdatDesErrInfo_t msg;
	DEBUG_TRCIN();

	if(NULL == errCode)
	{
		return -1;
	}

	msg.header.msgId = EDAT_ASYNC_SET_BOARD_ERRCODE;
	memcpy(msg.errCode, errCode, EDAT_ERROR_CODE_LEN);
	msg.errCodeRating = errCodeRating;
	msg.type = EERR_TYPE_BOARD;

	FRM_MsgSendAsync(EDAT_SPORT, sizeof(EdatDesErrInfo_t), &msg);
	DEBUG_TRCOUT();
	return 0;
}

/*==========================================================================*/
/*	Description		:设置类型为PCS的错误信息								*/
/*--------------------------------------------------------------------------*/
/*	param			:schar const *errCode	错误代码						*/
/*					schar errCodeRating		错误等级						*/
/*--------------------------------------------------------------------------*/
/*	return			:slong	処理結果										*/
/*						0	正常	-1	異常								*/
/*--------------------------------------------------------------------------*/
/*	detail			:设置类型为PCS的错误信息								*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/23 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
slong EDAT_SetPcsErr(schar const *errCode, schar errCodeRating)
{
	EdatDesErrInfo_t msg;
	DEBUG_TRCIN();

	if(NULL == errCode)
	{
		return -1;
	}

	msg.header.msgId = EDAT_ASYNC_SET_PCS_ERRCODE;
	memcpy(msg.errCode, errCode, EDAT_ERROR_CODE_LEN);
	msg.errCodeRating = errCodeRating;
	msg.type = EERR_TYPE_PCS;

	FRM_MsgSendAsync(EDAT_SPORT, sizeof(EdatDesErrInfo_t), &msg);
	DEBUG_TRCOUT();
	return 0;
}

/*==========================================================================*/
/*	Description		:设置类型为RMC的错误信息								*/
/*--------------------------------------------------------------------------*/
/*	param			:schar const *errCode	错误代码						*/
/*					schar errCodeRating		错误等级						*/
/*--------------------------------------------------------------------------*/
/*	return			:slong	処理結果										*/
/*						0	正常	-1	異常								*/
/*--------------------------------------------------------------------------*/
/*	detail			:设置类型为RMC的错误信息								*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/23 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
slong EDAT_SetRmcErr(schar const *errCode, schar errCodeRating)
{
	EdatDesErrInfo_t msg;
	DEBUG_TRCIN();

	if(NULL == errCode)
	{
		return -1;
	}

	msg.header.msgId = EDAT_ASYNC_SET_RMC_ERRCODE;
	memcpy(msg.errCode, errCode, EDAT_ERROR_CODE_LEN);
	msg.errCodeRating = errCodeRating;
	msg.type = EERR_TYPE_RMC;

	FRM_MsgSendAsync(EDAT_SPORT, sizeof(EdatDesErrInfo_t), &msg);
	DEBUG_TRCOUT();
	return 0;
}

/*==========================================================================*/
/*	Description		:获取优先级最高错误										*/
/*--------------------------------------------------------------------------*/
/*	param			:EdatErrInfo_t *info	错误信息						*/
/*--------------------------------------------------------------------------*/
/*	return			:slong	処理結果										*/
/*						0	正常	-1	異常								*/
/*--------------------------------------------------------------------------*/
/*	detail			:获取优先级最高错误										*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/14 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
slong EDAT_GetErrInfo(EdatErrInfo_t *info)
{
	slong getErrFlag = EDAT_OK;
	DEBUG_TRCIN();
	getErrFlag = EDAT_GetErrCode(info);
	DEBUG_TRCOUT();
	return (getErrFlag);
}

/*==========================================================================*/
/*	Description		:清除链表中类型为通信ボード的指定错误(异步)				*/
/*--------------------------------------------------------------------------*/
/*	param			:schar const *errCode	错误代码						*/
/*--------------------------------------------------------------------------*/
/*	return			:slong	処理結果										*/
/*						0	正常	-1	異常								*/
/*--------------------------------------------------------------------------*/
/*	detail			:清除链表中类型为通信ボード的指定错误(异步)				*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
slong EDAT_ClearBoardErr(schar const *errCode)
{
	EdatClearDesErr_t msg;
	DEBUG_TRCIN();

	if(NULL == errCode)
	{
		return -1;
	}
	msg.header.msgId = EDAT_ASYNC_CLEAR_BOARD_ERROR;
	memcpy(msg.errCode, errCode, EDAT_ERROR_CODE_LEN);
	msg.type = EERR_TYPE_BOARD;
	FRM_MsgSendAsync(EDAT_SPORT, sizeof(EdatClearDesErr_t), &msg);

	DEBUG_TRCOUT();
	return 0;
}

/*==========================================================================*/
/*	Description		:清除链表中类型为PCS的指定错误(异步)					*/
/*--------------------------------------------------------------------------*/
/*	param			:schar const *errCode	错误代码						*/
/*--------------------------------------------------------------------------*/
/*	return			:slong	処理結果										*/
/*						0	正常	-1	異常								*/
/*--------------------------------------------------------------------------*/
/*	detail			:清除链表中类型为PCS的指定错误(异步)					*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/23 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
slong EDAT_ClearPcsErr(schar const *errCode)
{
	EdatClearDesErr_t msg;
	DEBUG_TRCIN();

	if(NULL == errCode)
	{
		return -1;
	}
	msg.header.msgId = EDAT_ASYNC_CLEAR_PCS_ERROR;
	memcpy(msg.errCode, errCode, EDAT_ERROR_CODE_LEN);
	msg.type = EERR_TYPE_PCS;
	FRM_MsgSendAsync(EDAT_SPORT, sizeof(EdatClearDesErr_t), &msg);

	DEBUG_TRCOUT();
	return 0;
}

/*==========================================================================*/
/*	Description		:清除链表中类型为RMC的指定错误(异步)					*/
/*--------------------------------------------------------------------------*/
/*	param			:schar const *errCode	错误代码						*/
/*--------------------------------------------------------------------------*/
/*	return			:slong	処理結果										*/
/*						0	正常	-1	異常								*/
/*--------------------------------------------------------------------------*/
/*	detail			:清除链表中类型为RMC的指定错误(异步)					*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/23 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
slong EDAT_ClearRmcErr(schar const *errCode)
{
	EdatClearDesErr_t msg;
	DEBUG_TRCIN();

	if(NULL == errCode)
	{
		return -1;
	}
	msg.header.msgId = EDAT_ASYNC_CLEAR_RMC_ERROR;
	memcpy(msg.errCode, errCode, EDAT_ERROR_CODE_LEN);
	msg.type = EERR_TYPE_RMC;
	FRM_MsgSendAsync(EDAT_SPORT, sizeof(EdatClearDesErr_t), &msg);

	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:清除链表中存储的所有类型为通信ボード错误(异步)			*/
/*--------------------------------------------------------------------------*/
/*	param			:無い													*/
/*--------------------------------------------------------------------------*/
/*	return			:slong	処理結果										*/
/*						0	正常	-1	異常								*/
/*--------------------------------------------------------------------------*/
/*	detail			:清除链表中存储的所有类型为通信ボード错误(异步)			*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/23 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
slong EDAT_ClearAllBoardErr(void)
{
	EdatClearAllDesErr_t msg;
	DEBUG_TRCIN();

	msg.header.msgId = EDAT_ASYNC_CLEAR_ALL_BOARD_ERROR;
	msg.type = EERR_TYPE_BOARD;
	FRM_MsgSendAsync(EDAT_SPORT, sizeof(EdatClearAllDesErr_t), &msg);

	DEBUG_TRCOUT();
	return 0;
}

/*==========================================================================*/
/*	Description		:清除链表中存储的所有类型为PCS错误(异步)				*/
/*--------------------------------------------------------------------------*/
/*	param			:無い													*/
/*--------------------------------------------------------------------------*/
/*	return			:slong	処理結果										*/
/*						0	正常	-1	異常								*/
/*--------------------------------------------------------------------------*/
/*	detail			:清除链表中存储的所有类型为PCS错误(异步)				*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/23 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
slong EDAT_ClearAllPcsErr(void)
{
	EdatClearAllDesErr_t msg;
	DEBUG_TRCIN();

	msg.header.msgId = EDAT_ASYNC_CLEAR_ALL_PCS_ERROR;
	msg.type = EERR_TYPE_PCS;
	FRM_MsgSendAsync(EDAT_SPORT, sizeof(EdatClearAllDesErr_t), &msg);

	DEBUG_TRCOUT();
	return 0;
}

/*==========================================================================*/
/*	Description		:清除链表中存储的所有类型为RMC的错误(异步)				*/
/*--------------------------------------------------------------------------*/
/*	param			:無い													*/
/*--------------------------------------------------------------------------*/
/*	return			:slong	処理結果										*/
/*						0	正常	-1	異常								*/
/*--------------------------------------------------------------------------*/
/*	detail			:清除链表中存储的所有类型为RMC的错误(异步)				*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/23 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
slong EDAT_ClearAllRmcErr(void)
{
	EdatClearAllDesErr_t msg;
	DEBUG_TRCIN();

	msg.header.msgId = EDAT_ASYNC_CLEAR_ALL_RMC_ERROR;
	msg.type = EERR_TYPE_RMC;
	FRM_MsgSendAsync(EDAT_SPORT, sizeof(EdatClearAllDesErr_t), &msg);

	DEBUG_TRCOUT();
	return 0;
}

/*==========================================================================*/
/*	Description		:清除存储的所有错误(异步)								*/
/*--------------------------------------------------------------------------*/
/*	param			:無い													*/
/*--------------------------------------------------------------------------*/
/*	return			:slong	処理結果										*/
/*						0	正常	-1	異常								*/
/*--------------------------------------------------------------------------*/
/*	detail			:清除存储的所有错误(异步)								*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
slong EDAT_ClearAllErr(void)
{
	EdatClearAllErr_t msg;
	DEBUG_TRCIN();

	msg.header.msgId = EDAT_ASYNC_CLEAR_ALL_ERROR;
	FRM_MsgSendAsync(EDAT_SPORT, sizeof(EdatClearAllErr_t), &msg);

	DEBUG_TRCOUT();	
	return 0;
}

/*==========================================================================*/
/*	Description		:获取优先级最高的通信ボード错误							*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:获取优先级最高的通信ボード错误							*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
slong EDAT_GetBoardErrInfo(EdatErrInfo_t *info)
{
	slong getErrFlag = EDAT_OK;
	DEBUG_TRCIN();
	getErrFlag = EDAT_GetBoardErrCode(info);
	DEBUG_TRCOUT();
	return (getErrFlag);
}

/*==========================================================================*/
/*	Description		:获取优先级最高的PCS错误								*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:获取优先级最高的PCS错误								*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
slong EDAT_GetPcsErrInfo(EdatErrInfo_t *info)
{
	slong getErrFlag = EDAT_OK;
	DEBUG_TRCIN();
	getErrFlag = EDAT_GetPcsErrCode(info);
	DEBUG_TRCOUT();
	return (getErrFlag);
}

/*==========================================================================*/
/*	Description		:获取优先级最高的RMC错误								*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:获取优先级最高的RMC错误								*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
slong EDAT_GetRmcErrInfo(EdatErrInfo_t *info)
{
	slong getErrFlag = EDAT_OK;
	DEBUG_TRCIN();
	getErrFlag = EDAT_GetRmcErrCode(info);
	DEBUG_TRCOUT();
	return (getErrFlag);
}

/*==========================================================================*/
/*	Description		:根据类型与错误前缀查找错误								*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:根据类型与错误前缀查找错误								*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
slong EDAT_FindErrByPrefix(EerrType_t type, const schar *prefix)
{
	slong getErrFlag = EDAT_ERROR;
	DEBUG_TRCIN();
	if(NULL == prefix)
	{
		return (getErrFlag);
	}
	else
	{
		getErrFlag = EDAT_FindErr(type, prefix);
	}
	DEBUG_TRCOUT();
	return (getErrFlag);
}

/*==========================================================================*/
/*	Description		:EDAT模块初始化											*/
/*--------------------------------------------------------------------------*/
/*	param			:無い													*/
/*--------------------------------------------------------------------------*/
/*	return			:無い													*/
/*--------------------------------------------------------------------------*/
/*	detail			:EDAT模块初始化											*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
void EDAT_Init(void)
{
	DEBUG_TRCIN();

	/* read defaule value file */
	EDAT_ValInit();

	/*TODO:*/
	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:EDAT模块资源释放										*/
/*--------------------------------------------------------------------------*/
/*	param			:無い													*/
/*--------------------------------------------------------------------------*/
/*	return			:無い													*/
/*--------------------------------------------------------------------------*/
/*	detail			:EDAT模块资源释放										*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
void EDAT_Fin(void)
{
	DEBUG_TRCIN();
	/*TODO:*/
	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:EDAT模块消息处理										*/
/*--------------------------------------------------------------------------*/
/*	param			:FrmMsgHead_t const *msg 消息							*/
/*--------------------------------------------------------------------------*/
/*	return			:無い													*/
/*--------------------------------------------------------------------------*/
/*	detail			:EDAT模块消息处理										*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
void EDAT_MsgProc(FrmMsgHead_t const *msg)
{
	DEBUG_TRCIN();
	switch (msg->attr)
	{
		case FRM_MSG_ASYNC:
			switch(msg->msgId)
			{
				case EDAT_MSGID_START:
				{
					EdatStart_t const* procStart = (EdatStart_t const*)msg;
					EDAT_Start(procStart->fact);
					break;
				}
				case EDAT_ASYNC_SET_BOARD_ERRCODE:
				{
					EDAT_SetBoardErrInfo((EdatDesErrInfo_t*)msg);
					break;
				}
				case EDAT_ASYNC_SET_PCS_ERRCODE:
				{
					EDAT_SetPcsErrInfo((EdatDesErrInfo_t*)msg);
					break;
				}
				case EDAT_ASYNC_SET_RMC_ERRCODE:
				{
					EDAT_SetRmcErrInfo((EdatDesErrInfo_t*)msg);
					break;
				}
				case EDAT_ASYNC_CLEAR_BOARD_ERROR:
				{
					EDAT_ClearBoardErrInfo((EdatClearDesErr_t*)msg);
					break;
				}
				case EDAT_ASYNC_CLEAR_PCS_ERROR:
				{
					EDAT_ClearPcsErrInfo((EdatClearDesErr_t*)msg);
					break;
				}
				case EDAT_ASYNC_CLEAR_RMC_ERROR:
				{
					EDAT_ClearRmcErrInfo((EdatClearDesErr_t*)msg);
					break;
				}
				case EDAT_ASYNC_CLEAR_ALL_BOARD_ERROR:
				{
					EDAT_ClearAllBoardErrInfo((EdatClearAllDesErr_t*)msg);
					break;
				}
				case EDAT_ASYNC_CLEAR_ALL_PCS_ERROR:
				{
					EDAT_ClearAllPcsErrInfo((EdatClearAllDesErr_t*)msg);
					break;
				}
				case EDAT_ASYNC_CLEAR_ALL_RMC_ERROR:
				{
					EDAT_ClearAllRmcErrInfo((EdatClearAllDesErr_t*)msg);
					break;
				}
				case EDAT_ASYNC_CLEAR_ALL_ERROR:
				{
					EDAT_ClearAllErrInfo((EdatClearAllErr_t*)msg);
					break;
				}
			}
		break;
		default:
			break;
	}
	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:错误管理功能开始										*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:错误管理功能开始处理									*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
extern slong EDAT_Start(slong fact)
{
	EdatStart_t msg;
	DEBUG_TRCIN();

	msg.header.msgId = EDAT_MSGID_START;
	msg.fact = fact;
	FRM_MsgSendAsync(EDAT_SPORT, sizeof(EdatStart_t), &msg);

	DEBUG_TRCOUT();
	return 0;
}

/*==========================================================================*/
/*	Description		:错误管理功能停止										*/
/*--------------------------------------------------------------------------*/
/*	param			:無い													*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:错误管理功能停止处理									*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC jingtong.li : 新規作成				*/
/*==========================================================================*/
slong EDAT_Stop(void)
{
	DEBUG_TRCIN();
	/*TODO:*/
	DEBUG_TRCOUT();
	return 0;
}
/*--------------------------------------------------------------------------*/
/*	非公開関数定義															*/
/*--------------------------------------------------------------------------*/


/*End Of File*/
