/****************************************************************************/
/*	Description		:														*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC Wang.M												*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/03/23												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:INV通信												*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2020 NICHICON CORPORATION							*/
/****************************************************************************/

/*--------------------------------------------------------------------------*/
/*	Include Header File														*/
/*--------------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <pthread.h>

#include "typedef.h"
#include "task_g.h"
#include "frm_g.h"
#include "common_g.h"
#include "dlog_g.h"

#include "einv_g.h"
#include "einv_msg_g.h"
#include "einv_ram_g.h"
#include "einv_ram.h"

/*--------------------------------------------------------------------------*/
/*	公開変数定義															*/
/*--------------------------------------------------------------------------*/
sint				g_einvFd;				/* UART0ドライバのファイルディスクリプタ */
sint				g_gpioDesc;				/* データイネーブル用GPIOディスクリプタ	*/
EinvStts_t			g_einvStts;				/* INV通信ミドルのプロセス状態 			*/
pthread_mutex_t		g_einvSttsMutex;		/* INV通信ミドルのプロセス状態排他mutex	*/
bool_t				g_shutdown = FALSE;		/* シャットダウンフラグ					*/
pthread_mutex_t		g_shutdownMutex;		/* シャットダウンフラグ排他mutex		*/
ushort				g_einvThreadLifePoint;	/* INV通信スレッドのライフポイント		*/
bool_t				g_einvWdtTermRes;		/* 常駐プロセス終了応答通知完了フラグ	*/

/*--------------------------------------------------------------------------*/
/*	非公開変数定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	公開関数定義															*/
/*--------------------------------------------------------------------------*/

/*==========================================================================*/
/*	Description	:グローバル変数の初期化										*/
/*--------------------------------------------------------------------------*/
/*	param		:なし														*/
/*--------------------------------------------------------------------------*/
/*	return		:なし														*/
/*--------------------------------------------------------------------------*/
/*	detail		:グローバル変数の初期化を行う。								*/
/*--------------------------------------------------------------------------*/
/*	history		：2023/03/27 : DHC Dai.P : 新規作成							*/
/*==========================================================================*/
void EINV_InitRam(void)
{
	DEBUG_TRCIN();

	/* グローバル変数アクセス排他用mutex */
	CMN_MutexInit( &g_einvSttsMutex );				/* INV通信ミドルのプロセス状態排他mutex	*/
	CMN_MutexInit( &g_shutdownMutex );				/* シャットダウンフラグ排他mutex		*/

	/* 変数初期値設定（この段階では排他の必要なし） */
	g_einvStts = EINV_STTS_COMM_UNCONF;			/* INV通信ミドルのプロセス状態 			*/
	g_shutdown = FALSE;							/* シャットダウンフラグ					*/
	g_einvThreadLifePoint = 0U;					/* INV通信スレッドのライフポイント		*/
	g_einvWdtTermRes = FALSE;					/* 常駐プロセス終了応答通知完了フラグ	*/

	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description	:プロセス状態設定(setter)処理								*/
/*--------------------------------------------------------------------------*/
/*	param		:val	:設定データ											*/
/*--------------------------------------------------------------------------*/
/*	return		:なし														*/
/*--------------------------------------------------------------------------*/
/*	detail		:プロセス状態設定(setter)処理を行う。						*/
/*--------------------------------------------------------------------------*/
/*	history		：2023/03/30 : DHC Dai.P : 新規作成							*/
/*==========================================================================*/
void EINV_SetInvStts( EinvStts_t val )
{
	DEBUG_TRCIN();
	CMN_MutexLock( &g_einvSttsMutex );
	g_einvStts = val;
	CMN_MutexUnlock( &g_einvSttsMutex );
	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description	:プロセス状態取得(getter)処理								*/
/*--------------------------------------------------------------------------*/
/*	param		:なし														*/
/*--------------------------------------------------------------------------*/
/*	return		:val	設定データ											*/
/*--------------------------------------------------------------------------*/
/*	detail		:プロセス状態取得(getter)処理を行う。						*/
/*--------------------------------------------------------------------------*/
/*	history		：2023/03/30 : DHC Dai.P : 新規作成							*/
/*==========================================================================*/
EinvStts_t EINV_GetInvStts(void)
{
	EinvStts_t val;
	DEBUG_TRCIN();
	CMN_MutexLock( &g_einvSttsMutex );
	val = g_einvStts;
	CMN_MutexUnlock( &g_einvSttsMutex );
	DEBUG_TRCOUT();
	return val;
}

/*==========================================================================*/
/*	Description	:シャットダウンフラグ設定(setter)処理						*/
/*--------------------------------------------------------------------------*/
/*	param		:val	:設定データ											*/
/*--------------------------------------------------------------------------*/
/*	return		:なし														*/
/*--------------------------------------------------------------------------*/
/*	detail		:シャットダウンフラグ設定(setter)処理を行う。				*/
/*--------------------------------------------------------------------------*/
/*	history		：2023/03/30 : DHC Dai.P : 新規作成							*/
/*==========================================================================*/
void EINV_SetShutdown( bool_t val )
{
	DEBUG_TRCIN();
	CMN_MutexLock( &g_shutdownMutex );
	g_shutdown = val;
	CMN_MutexUnlock( &g_shutdownMutex );
	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description	:シャットダウンフラグ取得(getter)処理						*/
/*--------------------------------------------------------------------------*/
/*	param		:なし														*/
/*--------------------------------------------------------------------------*/
/*	return		:val	設定データ											*/
/*--------------------------------------------------------------------------*/
/*	detail		:シャットダウンフラグ取得(getter)処理を行う。				*/
/*--------------------------------------------------------------------------*/
/*	history		：2023/03/30 : DHC Dai.P : 新規作成							*/
/*==========================================================================*/
bool_t EINV_GetShutdown(void)
{
	bool_t val;
	DEBUG_TRCIN();
	CMN_MutexLock( &g_shutdownMutex );
	val = g_shutdown;
	CMN_MutexUnlock( &g_shutdownMutex );
	DEBUG_TRCOUT();
	return val;
}

/*==========================================================================*/
/*	Description	:INV通信スレッドのライフポイント設定(setter)処理			*/
/*--------------------------------------------------------------------------*/
/*	param		:val	:設定データ											*/
/*--------------------------------------------------------------------------*/
/*	return		:なし														*/
/*--------------------------------------------------------------------------*/
/*	detail		:INV通信スレッドのライフポイント設定(setter)処理を行う。	*/
/*--------------------------------------------------------------------------*/
/*	history		：2023/03/30 : DHC Dai.P : 新規作成							*/
/*==========================================================================*/
void EINV_SetThreadLifePoint( ushort val )
{
	DEBUG_TRCIN();
	CMN_MutexLock( &g_shutdownMutex );
	g_einvThreadLifePoint = val;
	CMN_MutexUnlock( &g_shutdownMutex );
	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description	:INV通信スレッドのライフポイント取得(getter)処理			*/
/*--------------------------------------------------------------------------*/
/*	param		:なし														*/
/*--------------------------------------------------------------------------*/
/*	return		:val	設定データ											*/
/*--------------------------------------------------------------------------*/
/*	detail		:INV通信スレッドのライフポイント取得(getter)処理を行う。	*/
/*--------------------------------------------------------------------------*/
/*	history		：2023/03/30 : DHC Dai.P : 新規作成							*/
/*==========================================================================*/
ushort EINV_GetThreadLifePoint(void)
{
	ushort val;
	DEBUG_TRCIN();
	CMN_MutexLock( &g_shutdownMutex );
	val = g_einvThreadLifePoint;
	CMN_MutexUnlock( &g_shutdownMutex );
	DEBUG_TRCOUT();
	return val;
}

/*==========================================================================*/
/*	Description	:常駐プロセス終了応答通知完了フラグ設定(setter)処理			*/
/*--------------------------------------------------------------------------*/
/*	param		:val	:設定データ											*/
/*--------------------------------------------------------------------------*/
/*	return		:なし														*/
/*--------------------------------------------------------------------------*/
/*	detail		:常駐プロセス終了応答通知完了フラグ設定(setter)処理を行う。	*/
/*--------------------------------------------------------------------------*/
/*	history		：2023/03/30 : DHC Dai.P : 新規作成							*/
/*==========================================================================*/
void EINV_SetTermRes( bool_t val )
{
	DEBUG_TRCIN();
	CMN_MutexLock( &g_shutdownMutex );
	g_einvWdtTermRes = val;
	CMN_MutexUnlock( &g_shutdownMutex );
	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description	:常駐プロセス終了応答通知完了フラグ取得(getter)処理			*/
/*--------------------------------------------------------------------------*/
/*	param		:なし														*/
/*--------------------------------------------------------------------------*/
/*	return		:val	設定データ											*/
/*--------------------------------------------------------------------------*/
/*	detail		:常駐プロセス終了応答通知完了フラグ取得(getter)処理を行う。	*/
/*--------------------------------------------------------------------------*/
/*	history		：2023/03/30 : DHC Dai.P : 新規作成							*/
/*==========================================================================*/
bool_t EINV_GetTermRes(void)
{
	bool_t val;
	DEBUG_TRCIN();
	CMN_MutexLock( &g_shutdownMutex );
	val = g_einvWdtTermRes;
	CMN_MutexUnlock( &g_shutdownMutex );
	DEBUG_TRCOUT();
	return val;
}

/*--------------------------------------------------------------------------*/
/*	非公開関数定義															*/
/*--------------------------------------------------------------------------*/


/*End Of File*/
