/****************************************************************************/
/*	Description		:INV通信ミドル 基幹処理									*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC Wang.M												*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/03/23												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:INV通信												*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2020 NICHICON CORPORATION							*/
/****************************************************************************/
#ifndef __EINV_SPEC_G_H__
#define __EINV_SPEC_G_H__


/*--------------------------------------------------------------------------*/
/*	Include Header File														*/
/*--------------------------------------------------------------------------*/
#include "typedef.h"
#include "einv_msg_g.h"


/*--------------------------------------------------------------------------*/
/*	マクロ定義																*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	公開型宣言、定義														*/
/*--------------------------------------------------------------------------*/
typedef enum {
	EINV_ST_KEEP = -1,
	EINV_ST_START = 0,		/* First state */
	EINV_ST_NORMAL,
	EINV_ST_TERMINAL,
	EINV_ST_TEST_RUN,
	EINV_ST_INV_OFFLINE,
	EINV_ST_MAINTENANCE,
	EINV_ST_FW_UPDATE,
	EINV_ST_MAX
} FsmState_t;


/*--------------------------------------------------------------------------*/
/*	定数宣言、定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	変数宣言																*/
/*--------------------------------------------------------------------------*/
extern FrmPthread_t g_einvComThread;	/* 通信スレッド */


/*--------------------------------------------------------------------------*/
/*	プロトタイプ宣言														*/
/*--------------------------------------------------------------------------*/
extern slong EINV_InitCommThread(void);
extern void EINV_FsmInit(FsmState_t initState);
extern void EINV_FsmSetState(FsmState_t state);
extern slong EINV_FsmRun(const FrmMsgHead_t *pMsg);
extern slong EINV_ProcInvCommunication(EinvMsgPar_t *reqMsg);
extern slong EINV_SpecGetOpeMode(EinvOpemodeGet_t *opeModeGet);
extern slong EINV_SpecGetOpeSttsInfo(EinvOpesttsInfo_t *opeSttsInfo);
extern slong EINV_SpecGetCalcAvgValue(EinvCalcAvg_t *calcAvgValueGet);
#endif /*__EINV_SPEC_G_H__*/
