/****************************************************************************/
/*	Description		:INV通信ミドル 外部IF									*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC Dai.P												*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/03/23												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:INV通信												*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2020 NICHICON CORPORATION							*/
/****************************************************************************/

/*--------------------------------------------------------------------------*/
/*	Include Header File														*/
/*--------------------------------------------------------------------------*/
#include <stddef.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

#include "typedef.h"
#include "frm_g.h"
#include "dlog_g.h"
#include "task_g.h"

#include "einv_msg_g.h"
#include "einv_n_g.h"
#include "einv_ram_g.h"
#include "einv_spec_g.h"
#include "einv_g.h"


/*--------------------------------------------------------------------------*/
/*	公開変数定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	非公開変数定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	公開関数定義															*/
/*--------------------------------------------------------------------------*/

/*==========================================================================*/
/*	Description		:	動作情報取得										*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_GetOpeSttsInfo(EinvOpesttsInfo_t *opeSttsInfo)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();

	ret = EINV_SpecGetOpeSttsInfo(opeSttsInfo);

	DEBUG_TRCOUT();	

	return ret;
}

/*==========================================================================*/
/*	Description		:	取得運転モード設定依頼元,指定電力運転フラグ			*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_GetOpeMode(EinvOpemodeGet_t *opeModeGet)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();

	ret = EINV_SpecGetOpeMode(opeModeGet);

	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:	運転モード設定										*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_SetOpeMode(const EinvOpemodeSet_t *opeModeSet)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();



	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:	req運転モード(cmd64)									*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_ReqOpeMode(void)
{
	slong ret = EINV_OK;
	slong msgRet = FRM_SUCCESS;
	EinvMsgPar_t par;

	DEBUG_TRCIN();

	/* 送信データ初期化 */
	memset(&par, 0x00, sizeof(par));

	par.header.msgId = EINV_FID_REQ_OPEMODE;
	/* par.header.opt.dw = port; */

	/* 非同期メッセージ送信 */
	msgRet = FRM_MsgSendAsync(EINV_SPORT, sizeof(par), (void*)&par);
	if(msgRet != FRM_SUCCESS)
	{
		DLOG_Error("FRM_MsgSendEvent fail\n");
		ret = EINV_ERR_SYSCALL;
	}
	else
	{
		/* 処理無し */
	}

	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:	非常時運転モード取得								*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_GetEmergencyMode(EinvOpemodeGet_t *opeModeGet)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();



	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:	非常時運転モード設定								*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_SetEmergencyMode(const EinvOpemodeSet_t *opeModeSet)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();



	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:	req非常時運転モード									*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_ReqEmergencyMode(void)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();



	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:	整定値取得											*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_GetSpData(EinvSpdataGet_t *spDataGet)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();



	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:	整定値隶ｾ定											*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_SetSpData(const EinvSpdataSetT *spDataSet)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();



	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:	req整定値											*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/20 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_ReqSpData(void)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();



	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:	登録情報取得										*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/24 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_GetRegInfo(EinvRegInfoGet_t *regInfoGet)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();



	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:	req登録情報											*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/24 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_ReqRegInfo(void)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();



	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:	特殊設定値情報隶ｾ定									*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/24 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_SetUniqueInfo(const EinvUniqueInfoSet_t *uniqueInfoSet)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();



	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:	V2H電力情報取得										*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/24 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_GetV2hValue(EinvV2HSetvalueGet_t *v2hValueGet)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();



	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:	V2H電力情報隶ｾ定										*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/24 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_SetV2hValue(const EinvV2HSetvalueSet_t *v2hValueSet)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();



	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:	reqV2H電力情報										*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/24 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_ReqV2hValue(void)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();



	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:	太陽光発電情報取得									*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/24 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_GetPvInfo(EinvPvinfoGet_t *pvInfoGet)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();



	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:	太陽光発電情報隶ｾ定									*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/24 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_SetPvInfo(const EinvPvinfoSet_t *pvInfoSet)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();



	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:	req太陽光発電情報									*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/04/24 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_ReqPvInfo(void)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();



	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:	CMD41表示用シグナル処理値取得						*/
/*--------------------------------------------------------------------------*/
/*	param			:														*/
/*--------------------------------------------------------------------------*/
/*	return			:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:														*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/05/04 : DHC Chongyang.Chen : 新規作成				*/
/*==========================================================================*/
slong EINV_GetCalcAvgValue(EinvCalcAvg_t *calcAvgValueGet)
{
	slong ret = EINV_OK;

	DEBUG_TRCIN();

	ret = EINV_SpecGetCalcAvgValue(calcAvgValueGet);

	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:試運転開始/停止/中止指示								*/
/*--------------------------------------------------------------------------*/
/*	param			:StartStop:試運転開始/停止/中止指示						*/
/*					:EINV_TESTRUN_START('1')								*/
/*					:EINV_TESTRUN_FIN('2')									*/
/*					:EINV_TESTRUN_PROABORT('3')								*/
/*--------------------------------------------------------------------------*/
/*	return			:EINV_OK:正常終了										*/
/*					:EINV_ERR_SYSCALL:システムコールエラー					*/
/*					:EINV_ERR_PARAM:パラメータエラー						*/
/*					:EINV_ERR_NOT_SUPPORT:非サポートエラー	状態論理矛盾	*/
/*--------------------------------------------------------------------------*/
/*	detail			:試運転開始/停止/中止指示								*/
/*					:試運転実行前の前提条件は通常稼働中の待機状態へ切替する	*/
/*					:試運転状態より、試運転指示受取しない場合がある			*/
/*					:重複指示無効											*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/05/04 : DHC Sun.JT : 新規作成						*/
/*==========================================================================*/
slong EINV_SetTestRunStartStop(uchar StartStop)
{
	slong ret = EINV_OK;
	EinvMsgPar_t msg;
	EinvMainStatus_t mainStatus;				/*システム状態*/
	uchar ctlRunMode;							/*管理運転モード*/
	TestRunSubFsmState_t testRunSubStatus;		/*試運転サブ状態*/
	EinvUpdate_t upDateFlag;
	uchar cmd81TestRunStatusFlag;				/*CMD81試運転状態フラッグ*/
	
	DEBUG_TRCIN();
	
	if((StartStop != EINV_TESTRUN_START) && 
	   (StartStop != EINV_TESTRUN_FIN) && 
	   (StartStop != EINV_TESTRUN_PROABORT))
	{
		ret = EINV_ERR_PARAM;
		return ret;
	}
	else
	{
		
	}
	
	memset(&msg, 0, sizeof(msg));
	/*管理運転モード取得*/
	ctlRunMode = EINV_n_GetCtlRunModeValue();
	/*システム運転取得*/
	mainStatus = EINV_n_GetSysStatusValue();
	/*試運転サブ状態取得*/
	testRunSubStatus = EINV_n_GetTestRunSubStatusValue();
	/*CMD81試運転状態取得*/
	cmd81TestRunStatusFlag = EINV_n_GetCmd81TestRunOutInfromValue();
	
	/*試運転指示設定*/
	EINV_n_SetTestRunRequestValue(StartStop);
	EINV_n_GetUpDateFlag(&upDateFlag);
	
	if(upDateFlag.TESTRUNREQUEST == EINV_SET)
	{
		/*試運転指示変更*/
		/*試運転開始指定*/
		if((StartStop == EINV_TESTRUN_START) &&
		   (mainStatus == EINV_SYS) && 
		   (ctlRunMode == EINV_COMMU_BOARD_MANAGE_MODE_7) &&
		   (testRunSubStatus == EINV_INVALIDVALUE) &&
		   (cmd81TestRunStatusFlag == EINV_TESTRUN_OFF)
		)
		{
			/*フレームワーク状態マトリクス遷移*/
			EINV_FsmSetState(EINV_ST_TEST_RUN);
			/*MAIN状態遷移 EINV_SYS->EINV_TEST*/
			EINV_n_SetSysStatusValue(EINV_TEST);
			/*試運転サブ状態更新*/
			EINV_n_SetTestRunSubStatusValue(EINV_TESTRUN_IDLE);
			/*CMD75コマンド発行完了フラッグ初期化*/
			EINV_n_SetTestRunCmd75SendFinishValue(EINV_CLR);
			/*CMD65コマンド発行完了フラッグ初期化*/
			EINV_n_SetTestRunCmd65SendFinishValue(EINV_CLR);
			/*試運転指示*/
			/*状態更新通知EINV_FID_TESTRUN_INDICATE*/
			msg.header.msgId = EINV_FID_TESTRUN_INDICATE;
			ret = FRM_MsgSendEvent(EINV_SPORT, sizeof(msg), (void*)&msg);
			if(ret != FRM_SUCCESS)
			{
				DLOG_Error("FRM_MsgSendEvent fail\n");
				ret = EINV_ERR_SYSCALL;
				/*状態と変数復帰処理*/
			}
			else
			{
				/* 正常終了 */
			}
			/*関連モジュールへ試運転開始通知*/
		}
		else if((StartStop == EINV_TESTRUN_PROABORT) &&
				(testRunSubStatus == EINV_TESTRUN_DO) &&
				(mainStatus == EINV_TEST)
		)
		{
			/*試運転中止処理*/
			/*状態更新通知EINV_FID_TESTRUN_ABORT*/
			msg.header.msgId = EINV_FID_TESTRUN_ABORT;
			ret = FRM_MsgSendEvent(EINV_SPORT, sizeof(msg), (void*)&msg);
			if(ret != FRM_SUCCESS)
			{
				DLOG_Error("FRM_MsgSendEvent fail\n");
				ret = EINV_ERR_SYSCALL;
				/*状態と変数復帰処理*/
			}
			else
			{
				/* 正常終了 */
			}
			/*関連モジュールへ試運転中止通知*/
		}
		else if((StartStop == EINV_TESTRUN_FIN) &&
				(testRunSubStatus == EINV_TESTRUN_DO) &&
				(mainStatus == EINV_TEST)
		)
		{
			/*試運転終了処理*/
			/*状態更新通知EINV_FID_TESTRUN_TERM*/
			msg.header.msgId = EINV_FID_TESTRUN_TERM;
			ret = FRM_MsgSendEvent(EINV_SPORT, sizeof(msg), (void*)&msg);
			if(ret != FRM_SUCCESS)
			{
				DLOG_Error("FRM_MsgSendEvent fail\n");
				ret = EINV_ERR_SYSCALL;
				/*状態と変数復帰処理*/
			}
			else
			{
				/* 正常終了 */
			}
			/*関連モジュールへ試運転終了通知*/
		}
		else
		{
			/*状態論理矛盾*/
			ret = EINV_ERR_NOT_SUPPORT;
		}
	}
	else
	{
		/*重複指示無効*/
		ret = EINV_ERR_PARAM;
	}
	
	/*試運転指示設定変更フラッグクリア*/
	EINV_n_ClrUpDateFlag();
	
	DEBUG_TRCOUT();

	return ret;
}

/*==========================================================================*/
/*	Description		:試運転開始可否											*/
/*--------------------------------------------------------------------------*/
/*	param			:無し													*/
/*--------------------------------------------------------------------------*/
/*	return			:EINV_TESTRUN_AVAILABLE('1')							*/
/*					:EINV_TESTRUN_UNAVAILABLE('0')							*/
/*					:														*/
/*--------------------------------------------------------------------------*/
/*	detail			:GET試運転開始可否										*/
/*	detail			:スマートフォン接続状態以外の判定条件					*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/05/05 : DHC Sun.JT : 新規作成						*/
/*==========================================================================*/
uchar EINV_GetTestRunAvailable()
{
	uchar ret = EINV_TESTRUN_UNAVAILABLE;
	EinvMainStatus_t mainStatus;				/*システム状態*/
	uchar ctlRunMode;							/*管理運転モード*/
	TestRunSubFsmState_t testRunSubStatus;		/*試運転サブ状態*/
	uchar cmd81TestRunStatusFlag;				/*CMD81試運転状態フラッグ*/
	uchar needTestRun;							/*試運転要否*/
	uchar testRunAnailable;						/*複数スマートフォン接続:EINV_TESTRUN_UNAVAILABLE*/
												/*  スマートフォン未接続:EINV_TESTRUN_UNAVAILABLE*/
												/*ONLY ONE スマートフォン接続:EINV_TESTRUN_AVAILABLE*/
	
	DEBUG_TRCIN();
	
	/*管理運転モード取得*/
	ctlRunMode = EINV_n_GetCtlRunModeValue();
	/*システム運転取得*/
	mainStatus = EINV_n_GetSysStatusValue();
	/*試運転サブ状態取得*/
	testRunSubStatus = EINV_n_GetTestRunSubStatusValue();
	/*CMD81試運転状態取得*/
	cmd81TestRunStatusFlag = EINV_n_GetCmd81TestRunOutInfromValue();
	/*試運転必要性チェック*/
	needTestRun = EINV_n_GetTestRunNeedValue();
	/*複数スマートフォン接続チェック*/
	testRunAnailable = EINV_n_GetTestRunAvailableValue();
	
	if((mainStatus == EINV_SYS) &&
	   (ctlRunMode == EINV_COMMU_BOARD_MANAGE_MODE_7) &&
	   (testRunSubStatus == EINV_INVALIDVALUE) &&
	   (cmd81TestRunStatusFlag == EINV_TESTRUN_OFF) &&
	   (needTestRun == EINV_NEED_TEST_RUN) &&
	   (testRunAnailable == EINV_TESTRUN_AVAILABLE)
	)
	{
		ret = EINV_TESTRUN_AVAILABLE;
	}
	else
	{
		ret = EINV_TESTRUN_UNAVAILABLE;
	}
	
	DEBUG_TRCOUT();

	return ret;
}
/*--------------------------------------------------------------------------*/
/*	非公開関数定義															*/
/*--------------------------------------------------------------------------*/


/*End Of File*/
