/****************************************************************************/
/*	Description		:INV通信ミドル グローバル変数定義						*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC Dai.P												*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/03/23												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:INV通信												*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2020 NICHICON CORPORATION							*/
/****************************************************************************/
#ifndef __EINV_RAM_G_H__
#define __EINV_RAM_G_H__


/*--------------------------------------------------------------------------*/
/*	Include Header File														*/
/*--------------------------------------------------------------------------*/
#include "typedef.h"
#include "task_g.h"
#include "einv_msg_g.h"


/*--------------------------------------------------------------------------*/
/*	マクロ定義																*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	公開型宣言、定義														*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	定数宣言、定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	変数宣言																*/
/*--------------------------------------------------------------------------*/
extern sint				g_einvFd;				/* UART0ドライバのファイルディスクリプタ */
extern sint				g_gpioDesc;				/* データイネーブル用GPIOディスクリプタ	*/
extern EinvStts_t		g_einvStts;				/* INV通信ミドルのプロセス状態 			*/
extern pthread_mutex_t	g_einvSttsMutex;		/* INV通信ミドルのプロセス状態排他mutex	*/
extern bool_t			g_shutdown;				/* シャットダウンフラグ					*/
extern pthread_mutex_t	g_shutdownMutex;		/* シャットダウンフラグ排他mutex		*/
extern ushort			g_einvThreadLifePoint;	/* INV通信スレッドのライフポイント		*/
extern bool_t			g_einvWdtTermRes;		/* 常駐プロセス終了応答通知完了フラグ	*/


/*--------------------------------------------------------------------------*/
/*	プロトタイプ宣言														*/
/*--------------------------------------------------------------------------*/
extern void EINV_InitRam(void);
extern void EINV_SetInvStts( EinvStts_t val );
extern EinvStts_t EINV_GetInvStts(void);
extern void EINV_SetShutdown( bool_t val );
extern bool_t EINV_GetShutdown( void );
extern void EINV_SetThreadLifePoint( ushort val );
extern ushort EINV_GetThreadLifePoint(void);
extern void EINV_SetTermRes( bool_t val );
extern bool_t EINV_GetTermRes(void);
#endif /*__EINV_RAM_G_H__*/
