/****************************************************************************/
/*	Description		:														*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC Xu.Y												*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/04/27												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:														*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2020 NICHICON CORPORATION							*/
/****************************************************************************/

/*--------------------------------------------------------------------------*/
/*	Include Header File														*/
/*--------------------------------------------------------------------------*/
#include <string.h>
#include "dlog_ringbuf.h"
#include "dlog_g.h"
/*--------------------------------------------------------------------------*/
/*	公開変数定義															*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/*	非公開変数定義															*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/*	公開関数定義															*/
/*--------------------------------------------------------------------------*/
/*==========================================================================*/
/*	Description		:	ringbuffer初始化									*/
/*--------------------------------------------------------------------------*/
/*	param			:	self					ringbuffer构造结构体指针	*/
/*					:	itemSize				每一块长度					*/
/*					:	buf						保存数据的缓冲区			*/
/*					:	bufSize					缓冲区长度					*/
/*--------------------------------------------------------------------------*/
/*	return			:	void												*/
/*--------------------------------------------------------------------------*/
/*	detail			:	ringbuffer初始化									*/
/*--------------------------------------------------------------------------*/
/*	history			:	2023/04/27 : DHC Xu.Y : 新規作成					*/
/*==========================================================================*/
void DLOG_RingbufInit(DlogRingbuf_t *self, slong itemSize, void *buf,
	slong bufSize)
{
	self->data = buf;
	self->size = itemSize;
	self->mask = dlog_RingbufRounddownPowOfTwo(bufSize / itemSize) - 1;
	self->in = self->out = 0;
}

/*==========================================================================*/
/*	Description		:	向ringbuffer写入数据								*/
/*--------------------------------------------------------------------------*/
/*	param			:	self					ringbuffer构造结构体指针	*/
/*					:	buf						保存数据的缓冲区			*/
/*					:	bufSize					缓冲区长度					*/
/*--------------------------------------------------------------------------*/
/*	return			:	result					写入的长度					*/
/*--------------------------------------------------------------------------*/
/*	detail			:	向ringbuffer写入数据								*/
/*--------------------------------------------------------------------------*/
/*	history			:	2023/04/27 : DHC Xu.Y : 新規作成					*/
/*==========================================================================*/
slong DLOG_RingbufIn(DlogRingbuf_t *self, const void *buf, slong bufSize)
{
	slong	result	= 0;
	slong	avail	= 0;

	if ((NULL == self) || (NULL == buf) || (!bufSize))
	{
		/* DO NOTHING */
	}
	else
	{
		avail = dlog_RingbufAvail(self);
		if (avail < bufSize)
		{
			bufSize = avail;
		}
		else
		{
			/* DO NOTHING */
		}

		dlog_RingbufCopyIn(self, buf, bufSize, self->in);

		self->in += bufSize;
		result = bufSize;
	}

	return result;
}

/*==========================================================================*/
/*	Description		:	从ringbuffer中读取数据								*/
/*--------------------------------------------------------------------------*/
/*	param			:	self					ringbuffer构造结构体指针	*/
/*					:	buf						保存数据的缓冲区			*/
/*					:	bufSize					缓冲区长度					*/
/*--------------------------------------------------------------------------*/
/*	return			:	result					读取的长度					*/
/*--------------------------------------------------------------------------*/
/*	detail			:	从ringbuffer中读取数据								*/
/*--------------------------------------------------------------------------*/
/*	history			:	2023/04/27 : DHC Xu.Y : 新規作成					*/
/*==========================================================================*/
slong DLOG_RingbufOut(DlogRingbuf_t *self, const void *buf, slong bufSize)
{
	slong result = 0;

	if ((NULL == self) || (NULL == buf) || (!bufSize))
	{
		/* DO NOTHING */
	}
	else
	{
		bufSize = dlog_RingbufOutPeek(self, buf, bufSize);
		self->out += bufSize;
		result = bufSize;
	}

	return result;
}

/*==========================================================================*/
/*	Description		:	判断ringbuffer是否已满								*/
/*--------------------------------------------------------------------------*/
/*	param			:	self					ringbuffer构造结构体指针	*/
/*--------------------------------------------------------------------------*/
/*	return			:	TRUE					ringbuffer已满				*/
/*					:	FALSE					ringbuffer未满				*/
/*--------------------------------------------------------------------------*/
/*	detail			:	判断ringbuffer是否已满								*/
/*--------------------------------------------------------------------------*/
/*	history			:	2023/04/27 : DHC Xu.Y : 新規作成					*/
/*==========================================================================*/
bool_t DLOG_RingbufIsFull(DlogRingbuf_t *self)
{
	bool_t	result		= FALSE;
	slong	ringbufLen	= 0;

	if (NULL == self)
	{
		/* DO NOTHING */
	}
	else
	{
		ringbufLen = dlog_RingbufLen(self);
		if (ringbufLen > self->mask)
		{
			result = TRUE;
		}
		else
		{
			/* DO NOTHING */
		}
	}

	return result;
}

/*==========================================================================*/
/*	Description		:	ringbuffer判空										*/
/*--------------------------------------------------------------------------*/
/*	param			:	self					ringbuffer构造结构体指针	*/
/*--------------------------------------------------------------------------*/
/*	return			:	TRUE					ringbuffer空				*/
/*					:	FALSE					ringbuffer非空				*/
/*--------------------------------------------------------------------------*/
/*	detail			:	ringbuffer判空										*/
/*--------------------------------------------------------------------------*/
/*	history			:	2023/04/27 : DHC Xu.Y : 新規作成					*/
/*==========================================================================*/
bool_t DLOG_RingbufIsEmpty(DlogRingbuf_t *self)
{
	bool_t result = FALSE;

	if (NULL == self)
	{
		/* DO NOTHING */
	}
	else
	{
		if (self->in == self->out)
		{
			result = TRUE;
		}
		else
		{
			/* DO NOTHING */
		}
	}

	return result;
}

/*--------------------------------------------------------------------------*/
/*	非公開関数定義															*/
/*--------------------------------------------------------------------------*/
/*==========================================================================*/
/*	Description		:	设置ringbuffer长度									*/
/*--------------------------------------------------------------------------*/
/*	param			:	mask					ringbuffer size				*/
/*--------------------------------------------------------------------------*/
/*	return			:	result					ringbuffer的长度			*/
/*--------------------------------------------------------------------------*/
/*	detail			:	设置ringbuffer长度									*/
/*--------------------------------------------------------------------------*/
/*	history			:	2023/04/27 : DHC Xu.Y : 新規作成					*/
/*==========================================================================*/
static slong dlog_RingbufRounddownPowOfTwo(slong mask)
{
	slong result = 0;

	mask |= (mask >> 1);
	mask |= (mask >> 2);
	mask |= (mask >> 4);
	mask |= (mask >> 8);
	mask |= (mask >> 16);

	result = (mask + 1) >> 1;

	return result;
}

/*==========================================================================*/
/*	Description		:	获取ringbuffer长度									*/
/*--------------------------------------------------------------------------*/
/*	param			:	self					ringbuffer构造结构体指针	*/
/*--------------------------------------------------------------------------*/
/*	return			:	result					ringbuffer长度				*/
/*--------------------------------------------------------------------------*/
/*	detail			:	获取ringbuffer长度									*/
/*--------------------------------------------------------------------------*/
/*	history			:	2023/04/27 : DHC Xu.Y : 新規作成					*/
/*==========================================================================*/
static slong dlog_RingbufCap(DlogRingbuf_t *self)
{
	slong result = 0;

	if (NULL == self)
	{
		/* DO NOITHING */
	}
	else
	{
		result = self->mask + 1;
	}

	return result;
}

/*==========================================================================*/
/*	Description		:	获取ringbuffer已用空间长度							*/
/*--------------------------------------------------------------------------*/
/*	param			:	self					ringbuffer构造结构体指针	*/
/*--------------------------------------------------------------------------*/
/*	return			:	result					ringbuffer已用空间长度		*/
/*--------------------------------------------------------------------------*/
/*	detail			:	获取ringbuffer已用空间长度							*/
/*--------------------------------------------------------------------------*/
/*	history			:	2023/04/27 : DHC Xu.Y : 新規作成					*/
/*==========================================================================*/
static slong dlog_RingbufLen(DlogRingbuf_t *self)
{
	slong result = 0;

	if (NULL == self)
	{
		/* DO NOITHING */
	}
	else
	{
		result = self->in - self->out;
	}

	return result;
}

/*==========================================================================*/
/*	Description		:	获取ringbuffer剩余空间长度							*/
/*--------------------------------------------------------------------------*/
/*	param			:	self					ringbuffer构造结构体指针	*/
/*--------------------------------------------------------------------------*/
/*	return			:	result					ringbuffer剩余空间长度		*/
/*--------------------------------------------------------------------------*/
/*	detail			:	获取ringbuffer剩余空间长度							*/
/*--------------------------------------------------------------------------*/
/*	history			:	2023/04/27 : DHC Xu.Y : 新規作成					*/
/*==========================================================================*/
static slong dlog_RingbufAvail(DlogRingbuf_t *self)
{
	slong result = 0;

	if (NULL == self)
	{
		/* DO NOITHING */
	}
	else
	{
		result = dlog_RingbufCap(self) - dlog_RingbufLen(self);
	}

	return result;
}

/*==========================================================================*/
/*	Description		:	将数据copy到ringbuffer中							*/
/*--------------------------------------------------------------------------*/
/*	param			:	self					ringbuffer构造结构体指针	*/
/*					:	src						数据buf						*/
/*					:	copySize				数据长度					*/
/*					:	off						out位置						*/
/*--------------------------------------------------------------------------*/
/*	return			:	void												*/
/*--------------------------------------------------------------------------*/
/*	detail			:	将数据copy到ringbuffer中							*/
/*--------------------------------------------------------------------------*/
/*	history			:	2023/04/27 : DHC Xu.Y : 新規作成					*/
/*==========================================================================*/
static void dlog_RingbufCopyIn(DlogRingbuf_t *self, const void *src,
	slong copySize, slong off)
{
	slong maxSize	= self->mask + 1;
	slong itemSize	= self->size;
	slong copyLen	= 0;

	off &= self->mask;
	if (DLOG_RBF_DEF_SIZE != itemSize)
	{
		off			*= itemSize;
		maxSize		*= itemSize;
		copySize	*= itemSize;
	}
	else
	{
		/* DO NOTHING */
	}

	copyLen = GET_MIN(copySize, maxSize - off);

	memcpy(self->data + off, src, copyLen);
	memcpy(self->data, (const uchar *)src + copyLen, copySize - copyLen);
}

/*==========================================================================*/
/*	Description		:	将ringbuffer中数据copy到dst中						*/
/*--------------------------------------------------------------------------*/
/*	param			:	self					ringbuffer构造结构体指针	*/
/*					:	dst						数据buf						*/
/*					:	copySize				数据长度					*/
/*					:	off						out位置						*/
/*--------------------------------------------------------------------------*/
/*	return			:	void												*/
/*--------------------------------------------------------------------------*/
/*	detail			:	将ringbuffer中数据copy到dst中						*/
/*--------------------------------------------------------------------------*/
/*	history			:	2023/04/27 : DHC Xu.Y : 新規作成					*/
/*==========================================================================*/
static void dlog_RingbufCopyOut(DlogRingbuf_t *self, void *dst,
	slong copySize, slong off)
{
	slong maxSize	= self->mask + 1;
	slong itemSize	= self->size;
	slong copyLen	= 0;

	off &= self->mask;
	if (DLOG_RBF_DEF_SIZE != itemSize)
	{
		off			*= itemSize;
		maxSize		*= itemSize;
		copySize	*= itemSize;
	}
	else
	{
		/* DO NOTHING */
	}

	copyLen = GET_MIN(copySize, maxSize - off);

	memcpy(dst, self->data + off, copyLen);
	memcpy((uchar *)dst + copyLen, self->data, copySize - copyLen);
}

/*==========================================================================*/
/*	Description		:	计算ringbuffer len并copy数据						*/
/*--------------------------------------------------------------------------*/
/*	param			:	self					ringbuffer构造结构体指针	*/
/*					:	buf						数据buf						*/
/*					:	copySize				数据长度					*/
/*--------------------------------------------------------------------------*/
/*	return			:	result					读取的数据长度				*/
/*--------------------------------------------------------------------------*/
/*	detail			:	计算ringbuffer len并copy数据						*/
/*--------------------------------------------------------------------------*/
/*	history			:	2023/04/27 : DHC Xu.Y : 新規作成					*/
/*==========================================================================*/
static slong dlog_RingbufOutPeek(DlogRingbuf_t *self, void *buf,
	slong bufSize)
{
	slong result	= 0;
	slong len		= 0;

	if ((NULL == self) || (NULL == buf) || (!bufSize))
	{
		/* DO NOTHING */
	}
	else
	{
		len = self->in - self->out;
		if (len < bufSize)
		{
			bufSize = len;
		}
		else
		{
			/* DO NOTHING */
		}

		dlog_RingbufCopyOut(self, buf, bufSize, self->out);
		result = bufSize;
	}

	return result;
}

/*End Of File*/
