/****************************************************************************/
/*	Description		:消息队列												*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC yufeng.yang										*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/03/14												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:														*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2020 NICHICON CORPORATION							*/
/****************************************************************************/

/*--------------------------------------------------------------------------*/
/*	Include Header File														*/
/*--------------------------------------------------------------------------*/
#include <sys/msg.h>
#include <sys/sem.h>
#include <errno.h>
#include "dlog_g.h"
#include "lfw_g.h"
#include "lfw.h"
#include "frm_mtx_g.h"
/*--------------------------------------------------------------------------*/
/*	公開変数定義															*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	非公開変数定義															*/
/*--------------------------------------------------------------------------*/
/* 本进程消息队列Key */
slong s_lfwReceiver = 0;
/* 进程间有效互斥量 */
ProcessMutex_t s_lfwMutex;
/*--------------------------------------------------------------------------*/
/*	公開関数定義															*/
/*--------------------------------------------------------------------------*/

/*==========================================================================*/
/*	Description		:等待消息												*/
/*--------------------------------------------------------------------------*/
/*	param			:slong receiver:消息队列Key								*/
/*--------------------------------------------------------------------------*/
/*	param			:ushort msgType:消息类型								*/
/*--------------------------------------------------------------------------*/
/*	param			:void *retMsg:消息										*/
/*--------------------------------------------------------------------------*/
/*	return			:0:正常	-1:异常											*/
/*--------------------------------------------------------------------------*/
/*	detail			:等待接收消息队列的消息									*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/03/14 : DHC Chen.H : 新規作成					*/
/*==========================================================================*/
slong LFW_WaitMessage(slong receiver, ushort msgType, void *retMsg)
{
	slong msqid;
	slong ret = LFW_RET_OK;
	DEBUG_TRCIN();
	/* メッセージキューIDの取得(受信) */
	errno = 0;
	if((msqid = msgget((key_t)receiver, 0666 | IPC_CREAT)) == -1)
	{
		perror("msgget failure");
		ret = LFW_RET_ERR;
	}
	else{
		/* メッセージキューの受信 */
		errno = 0;
		if(msgrcv(msqid, retMsg, MSG_MAX_SIZE_DEF, msgType, 0) == -1)
		{
			perror("msgrcv failure");
			ret = LFW_RET_ERR;
		}
		else
		{
			/* 処理無し */
		}
	}
	DEBUG_TRCOUT();
	return ret;
}

/*==========================================================================*/
/*	Description		:异步消息发送											*/
/*--------------------------------------------------------------------------*/
/*	param			:ulong destModId:目标模块ID								*/
/*--------------------------------------------------------------------------*/
/*	param			:ushort msgSize:消息长度								*/
/*--------------------------------------------------------------------------*/
/*	param			:void *msg:消息											*/
/*--------------------------------------------------------------------------*/
/*	return			:0:正常	-1:异常											*/
/*--------------------------------------------------------------------------*/
/*	detail			:进程间发送异步消息										*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/03/14 : DHC Chen.H : 新規作成					*/
/*==========================================================================*/
slong LFW_SendAsync(ulong destModId, ushort msgSize, void *msg)
{
	DEBUG_TRCIN();
	DEBUG_TRCOUT();
	return lfw_MsgSend(destModId, LFW_MSG_ASYNC, msgSize, msg);
}

/*==========================================================================*/
/*	Description		:异步Event发送											*/
/*--------------------------------------------------------------------------*/
/*	param			:ulong destModId:目标模块ID								*/
/*--------------------------------------------------------------------------*/
/*	param			:ushort msgSize:消息长度								*/
/*--------------------------------------------------------------------------*/
/*	param			:void *msg:消息											*/
/*--------------------------------------------------------------------------*/
/*	return			:0:正常	-1:异常											*/
/*--------------------------------------------------------------------------*/
/*	detail			:进程间发送异步Event									*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/03/14 : DHC Chen.H : 新規作成					*/
/*==========================================================================*/
slong LFW_SendEvent(ulong destModId, ushort msgSize, void *msg)
{
	DEBUG_TRCIN();
	DEBUG_TRCOUT();
	return lfw_MsgSend(destModId, LFW_MSG_EVENT, msgSize, msg);
}

/*==========================================================================*/
/*	Description		:同步调用返回											*/
/*--------------------------------------------------------------------------*/
/*	param			:ulong destModId:目标模块ID								*/
/*--------------------------------------------------------------------------*/
/*	param			:ushort msgSize:消息长度								*/
/*--------------------------------------------------------------------------*/
/*	param			:void *msg:消息											*/
/*--------------------------------------------------------------------------*/
/*	return			:0:正常	-1:异常											*/
/*--------------------------------------------------------------------------*/
/*	detail			:进程间回复同步消息，使同步调用返回							*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/03/14 : DHC Chen.H : 新規作成					*/
/*==========================================================================*/
slong LFW_CallRet(ulong destModId, ushort msgSize, void *msg)
{
	slong msqid;
	slong ret = LFW_RET_OK;
	DEBUG_TRCIN();
	/* メッセージキューIDの取得(送信) */
	errno = 0;
	if((msqid = msgget((key_t)destModId, 0666 | IPC_CREAT)) == -1)
	{
		perror("msgget failure");
		ret = LFW_RET_ERR;
	}
	else
	{
		/* メッセージ送信 */
		LfwHead_t *msgHead = (LfwHead_t *)msg;
		msgHead->mType = MSG_TYPE_SSYNC;
		msgHead->srcModId = LFW_GetReceiver();
		msgHead->destModId = destModId;
		msgHead->attr = LFW_CALL_RET;
		msgHead->msgSize = msgSize;
		msgHead->retCode = 0;
		errno = 0;
		if(msgsnd(msqid, msg, msgSize - 4, 0) == -1)
		{
			perror("msgsnd failure");
			DLOG_Error("sync sendto[%ld] receiver[%lu]\n", msqid, destModId);
			ret = LFW_RET_ERR;
		}
		else
		{
			/* 処理無し */
		}
	}
	DEBUG_TRCOUT();
	return(ret);
}

/*==========================================================================*/
/*	Description		:同步调用												*/
/*--------------------------------------------------------------------------*/
/*	param			:ulong destModId:目标模块ID								*/
/*--------------------------------------------------------------------------*/
/*	param			:ushort msgSize:消息长度								*/
/*--------------------------------------------------------------------------*/
/*	param			:void *msg:消息											*/
/*--------------------------------------------------------------------------*/
/*	param			:void *retMsg:回复消息									*/
/*--------------------------------------------------------------------------*/
/*	return			:0:正常	-1:异常											*/
/*--------------------------------------------------------------------------*/
/*	detail			:进程间发送同步消息，并等待回复								*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/03/14 : DHC Chen.H : 新規作成					*/
/*==========================================================================*/
slong LFW_CallSync(ulong destModId, ushort msgSize, void *msg, void *retMsg)
{
	slong msqid;
	slong ret = LFW_RET_OK;
	DEBUG_TRCIN();
	/* メッセージキューIDの取得(送信) */
	errno = 0;
	if((msqid = msgget((key_t)destModId, 0666 | IPC_CREAT)) == -1)
	{
		perror("msgget failure");
		ret = LFW_RET_ERR;
	}
	else
	{
		/* メッセージ送信 */
		LfwHead_t *msgHead = (LfwHead_t *)msg;
		msgHead->mType = MSG_TYPE_ASYNC;
		msgHead->srcModId = LFW_GetReceiver();
		msgHead->destModId = destModId;
		msgHead->attr = LFW_CALL_SYNC;
		msgHead->msgSize = msgSize;
		msgHead->retCode = 0;
		FRM_MutexLock(s_lfwMutex);
		if (msgsnd(msqid, msg, msgSize - 4, 0) == 0)
		{
			/* メッセージ受信 */
			ret = LFW_WaitMessage(LFW_GetReceiver(), MSG_TYPE_SSYNC, retMsg);
		}
		else
		{
			DLOG_Debug("msgsnd failure");
		}
		FRM_MutexUnLock(s_lfwMutex);
	}
	DEBUG_TRCOUT();
	return(ret);
}

/*==========================================================================*/
/*	Description		:创建消息队列											*/
/*--------------------------------------------------------------------------*/
/*	param			:slong receiver:消息队列key								*/
/*--------------------------------------------------------------------------*/
/*	return			:void													*/
/*--------------------------------------------------------------------------*/
/*	detail			:创建消息队列											*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/03/14 : DHC Chen.H : 新規作成					*/
/*==========================================================================*/
void LFW_SetReceiver(slong receiver)
{
	slong msqid;
	schar dummy[MSG_MAX_SIZE_DEF];
	slong i;
	DEBUG_TRCIN();
	s_lfwReceiver = receiver;
	s_lfwMutex = FRM_MutexCreate(receiver);

	/* メッセージキューIDの取得(受信) */
	errno = 0;
	if((msqid = msgget((key_t)receiver, 0666 | IPC_CREAT)) == -1)
	{
		perror("msgget failure");
	}
	else
	{
#if 0
		/* メッセージキューの受信 */
		errno = 0;
		for(i = 0; i < 100; i++) {
			if(msgrcv(msqid,
					(void *)dummy, MSG_MAX_SIZE_DEF, 0, IPC_NOWAIT) == -1)
			{
				if(EAGAIN == errno){
					perror("waste remained message\n");
					break;
				}
				else
				{
					/* 処理無し */
				}
			}
		}
#endif
	}
	DEBUG_TRCOUT();
}

/*==========================================================================*/
/*	Description		:获取当前进程消息队列key								*/
/*--------------------------------------------------------------------------*/
/*	param			:void													*/
/*--------------------------------------------------------------------------*/
/*	return			:0:正常	-1:异常											*/
/*--------------------------------------------------------------------------*/
/*	detail			:获取当前进程消息队列key								*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/03/14 : DHC Chen.H : 新規作成					*/
/*==========================================================================*/
slong LFW_GetReceiver()
{
	DEBUG_TRCIN();
	DEBUG_TRCOUT();
	return s_lfwReceiver;
}

/*--------------------------------------------------------------------------*/
/*	非公開関数定義															*/
/*--------------------------------------------------------------------------*/
/*==========================================================================*/
/*	Description		:发送消息												*/
/*--------------------------------------------------------------------------*/
/*	param			:ulong destModId:目标模块ID								*/
/*--------------------------------------------------------------------------*/
/*	param			:ushort attr:消息属性									*/
/*--------------------------------------------------------------------------*/
/*	param			:ushort msgSize:消息长度								*/
/*--------------------------------------------------------------------------*/
/*	param			:void *msg:消息											*/
/*--------------------------------------------------------------------------*/
/*	return			:0:正常	-1:异常											*/
/*--------------------------------------------------------------------------*/
/*	detail			:给目标消息队列发送消息										*/
/*--------------------------------------------------------------------------*/
/*	history			:2023/03/14 : DHC Chen.H : 新規作成					*/
/*==========================================================================*/
static slong lfw_MsgSend(ulong destModId,
						ushort attr, ushort msgSize, void *msg)
{
	slong ret = LFW_RET_ERR;
	slong msqid = 0;
	DEBUG_TRCIN();
	if((msqid = msgget((key_t)destModId, 0666 | IPC_CREAT)) == -1)
	{
		DLOG_Error("msgget failure");
	}
	else
	{
		LfwHead_t *msgHead = (LfwHead_t *)msg;
		msgHead->mType = MSG_TYPE_ASYNC;
		msgHead->srcModId = LFW_GetReceiver();
		msgHead->destModId = destModId;
		msgHead->attr = attr;
		msgHead->msgSize = msgSize;
		msgHead->retCode = 0;
		if (msgsnd(msqid, msg, msgSize - 4, 0) == 0)
		{
			ret = LFW_RET_OK;
		}
		else
		{
			DLOG_Error("msgsnd failure");
		}
	}
	DEBUG_TRCOUT();
	return ret;
}

/*End Of File*/
