/****************************************************************************/
/*	Description		:														*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC Zhang.WY											*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/03/20												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:														*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2020 NICHICON CORPORATION							*/
/****************************************************************************/
#ifndef __CONFIG_H__
#define __CONFIG_H__
/*--------------------------------------------------------------------------*/
/*	マクロ定義																*/
/*--------------------------------------------------------------------------*/
/* request ref size define */
#define REQUSET_METHOD_MAX_SIZE 8
#define REQUSET_URL_MAX_SIZE 256
#define REQUEST_DATA_MAX_SIZE 8192
#define REQUEST_PREFIX_LENGTH 4 /* this define the request prefix length, currently all the request will head "/api" */
#define PATHINFO_HEAD_MAX_SIZE 16
#define AUTH_TOKEN_SIZE 32

/* method return success/fail */
#define RET_ERROR_CODE -1
#define RET_SUCCESS_CODE 1
/* define controller length */
#define CONTRLLER_MAX_CNT 32
#define CONTROLLER_NAME_SIZE 8

/* 发布级别：
 * 0：本地调试
 * 1：发布到web容器，但是不做权限验证
 * 2：发布到web容器，并作权限验证
*/
#define RELEASE_LEVEL 2

/* 以下配置的是：测试场景的相关开关 */
#if RELEASE_LEVEL == 0
	/* 使用固定URL测试*/
	#define TEST_FLG 1

	/* 跳过认证测试*/
	#define TEST_SKIP_AUTH 1
	
	/* log output level */
	/* 显示函数进出开关 */
	#define METHOD_ENTRY_LOG 1
	#define LOG_ERROR_OUT
	#define LOG_FATAL_OUT
	#define LOG_INFO_OUT
	#define LOG_WARN_OUT
	#define LOG_DEBUG_OUT
#elif RELEASE_LEVEL == 1
		/* 跳过认证测试*/
		#define TEST_SKIP_AUTH 1		
#endif /* RELEASE_LEVEL */
/*--------------------------------------------------------------------------*/
/*	公開型宣言、定義														*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/*	定数宣言、定義															*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/*	変数宣言																*/
/*--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------*/
/*	プロトタイプ宣言														*/
/*--------------------------------------------------------------------------*/

#endif /*__CONFIG_H__*/