/****************************************************************************/
/*	Description		:														*/
/*--------------------------------------------------------------------------*/
/*	Author			:DHC Zhang.WY											*/
/*--------------------------------------------------------------------------*/
/*	Date			:2023/03/08												*/
/*--------------------------------------------------------------------------*/
/*	Module Name		:														*/
/*--------------------------------------------------------------------------*/
/*	Note			:														*/
/*--------------------------------------------------------------------------*/
/*	Copyright		:(c) 2020 NICHICON CORPORATION							*/
/****************************************************************************/
#ifndef __TEST_G_H__
#define __TEST_G_H__
/*--------------------------------------------------------------------------*/
/*	マクロ定義																*/
/*--------------------------------------------------------------------------*/
#include "typedef.h"
#include "common_g.h"

/*--------------------------------------------------------------------------*/
/*	公開型宣言、定義														*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	定数宣言、定義															*/
/*--------------------------------------------------------------------------*/
typedef enum
{
	OUTPUTCTRL = 0,
	SPLASH,
	SPLASHINFO,
	STORAGESTATUS,
	HOME,
	MODESET,
	HISTORY_SEARCH,
	TRADEHIST,
	RECORDS,
	VEHICLERECORDS,
	POWERFLOW,
	NOTICE,
	CONFIG,
	TIMESET,
	ERRORDISP,
	EXTCTPOSCONFIRMINS,
	SWITCHMODULECTUSE
}RequestName;

/*--------------------------------------------------------------------------*/
/*	変数宣言																*/
/*--------------------------------------------------------------------------*/


/*--------------------------------------------------------------------------*/
/*	プロトタイプ宣言														*/
/*--------------------------------------------------------------------------*/
extern void stub_getRequestURL(RequestName requestName, schar *requestRaw, RequestData_t *request_data);
extern void TEST_session_generate(void);
extern int TEST_print_all_env(void);
extern int TEST_strtok(void);
extern void TEST_repeatadd(void);
extern void TEST_GetSession(void);
extern void TEST_Cookie(void);
extern void TEST_Ctrl_log(void);
extern void TEST_CTRL_GetContentByFormdata(void);

#endif /*__TEST_G_H__*/


